espressif/esp-idf/components/soc/esp32s31/register/soc/axi_dma_reg.h
/**
 * SPDX-FileCopyrightText: 2025-2026 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** AXI_DMA_IN_INT_RAW_CH0_REG register
 *  Raw status interrupt of channel 0
 */
#define AXI_DMA_IN_INT_RAW_CH0_REG (DR_REG_AXI_DMA_BASE + 0x0)
/** AXI_DMA_IN_DONE_CH0_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been received for Rx channel 0.
 */
#define AXI_DMA_IN_DONE_CH0_INT_RAW    (BIT(0))
#define AXI_DMA_IN_DONE_CH0_INT_RAW_M  (AXI_DMA_IN_DONE_CH0_INT_RAW_V << AXI_DMA_IN_DONE_CH0_INT_RAW_S)
#define AXI_DMA_IN_DONE_CH0_INT_RAW_V  0x00000001U
#define AXI_DMA_IN_DONE_CH0_INT_RAW_S  0
/** AXI_DMA_IN_SUC_EOF_CH0_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been received for Rx channel 0. For UHCI0 the raw interrupt bit
 *  turns to high level when the last data pointed by one inlink descriptor has been
 *  received and no data error is detected for Rx channel 0.
 */
#define AXI_DMA_IN_SUC_EOF_CH0_INT_RAW    (BIT(1))
#define AXI_DMA_IN_SUC_EOF_CH0_INT_RAW_M  (AXI_DMA_IN_SUC_EOF_CH0_INT_RAW_V << AXI_DMA_IN_SUC_EOF_CH0_INT_RAW_S)
#define AXI_DMA_IN_SUC_EOF_CH0_INT_RAW_V  0x00000001U
#define AXI_DMA_IN_SUC_EOF_CH0_INT_RAW_S  1
/** AXI_DMA_IN_ERR_EOF_CH0_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt bit turns to high level when data error is detected only in the
 *  case that the peripheral is UHCI0 for Rx channel 0. For other peripherals this raw
 *  interrupt is reserved.
 */
#define AXI_DMA_IN_ERR_EOF_CH0_INT_RAW    (BIT(2))
#define AXI_DMA_IN_ERR_EOF_CH0_INT_RAW_M  (AXI_DMA_IN_ERR_EOF_CH0_INT_RAW_V << AXI_DMA_IN_ERR_EOF_CH0_INT_RAW_S)
#define AXI_DMA_IN_ERR_EOF_CH0_INT_RAW_V  0x00000001U
#define AXI_DMA_IN_ERR_EOF_CH0_INT_RAW_S  2
/** AXI_DMA_IN_DSCR_ERR_CH0_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt bit turns to high level when detecting inlink descriptor error
 *  including owner error and the second and third word error of inlink descriptor for
 *  Rx channel 0.
 */
#define AXI_DMA_IN_DSCR_ERR_CH0_INT_RAW    (BIT(3))
#define AXI_DMA_IN_DSCR_ERR_CH0_INT_RAW_M  (AXI_DMA_IN_DSCR_ERR_CH0_INT_RAW_V << AXI_DMA_IN_DSCR_ERR_CH0_INT_RAW_S)
#define AXI_DMA_IN_DSCR_ERR_CH0_INT_RAW_V  0x00000001U
#define AXI_DMA_IN_DSCR_ERR_CH0_INT_RAW_S  3
/** AXI_DMA_IN_DSCR_EMPTY_CH0_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw interrupt bit turns to high level when Rx buffer pointed by inlink is full
 *  and receiving data is not completed but there is no more inlink for Rx channel 0.
 */
#define AXI_DMA_IN_DSCR_EMPTY_CH0_INT_RAW    (BIT(4))
#define AXI_DMA_IN_DSCR_EMPTY_CH0_INT_RAW_M  (AXI_DMA_IN_DSCR_EMPTY_CH0_INT_RAW_V << AXI_DMA_IN_DSCR_EMPTY_CH0_INT_RAW_S)
#define AXI_DMA_IN_DSCR_EMPTY_CH0_INT_RAW_V  0x00000001U
#define AXI_DMA_IN_DSCR_EMPTY_CH0_INT_RAW_S  4
/** AXI_DMA_INFIFO_L1_OVF_CH0_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
 *  overflow.
 */
#define AXI_DMA_INFIFO_L1_OVF_CH0_INT_RAW    (BIT(5))
#define AXI_DMA_INFIFO_L1_OVF_CH0_INT_RAW_M  (AXI_DMA_INFIFO_L1_OVF_CH0_INT_RAW_V << AXI_DMA_INFIFO_L1_OVF_CH0_INT_RAW_S)
#define AXI_DMA_INFIFO_L1_OVF_CH0_INT_RAW_V  0x00000001U
#define AXI_DMA_INFIFO_L1_OVF_CH0_INT_RAW_S  5
/** AXI_DMA_INFIFO_L1_UDF_CH0_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
 *  underflow.
 */
#define AXI_DMA_INFIFO_L1_UDF_CH0_INT_RAW    (BIT(6))
#define AXI_DMA_INFIFO_L1_UDF_CH0_INT_RAW_M  (AXI_DMA_INFIFO_L1_UDF_CH0_INT_RAW_V << AXI_DMA_INFIFO_L1_UDF_CH0_INT_RAW_S)
#define AXI_DMA_INFIFO_L1_UDF_CH0_INT_RAW_V  0x00000001U
#define AXI_DMA_INFIFO_L1_UDF_CH0_INT_RAW_S  6
/** AXI_DMA_INFIFO_L2_OVF_CH0_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
 *  overflow.
 */
#define AXI_DMA_INFIFO_L2_OVF_CH0_INT_RAW    (BIT(7))
#define AXI_DMA_INFIFO_L2_OVF_CH0_INT_RAW_M  (AXI_DMA_INFIFO_L2_OVF_CH0_INT_RAW_V << AXI_DMA_INFIFO_L2_OVF_CH0_INT_RAW_S)
#define AXI_DMA_INFIFO_L2_OVF_CH0_INT_RAW_V  0x00000001U
#define AXI_DMA_INFIFO_L2_OVF_CH0_INT_RAW_S  7
/** AXI_DMA_INFIFO_L2_UDF_CH0_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
 *  underflow.
 */
#define AXI_DMA_INFIFO_L2_UDF_CH0_INT_RAW    (BIT(8))
#define AXI_DMA_INFIFO_L2_UDF_CH0_INT_RAW_M  (AXI_DMA_INFIFO_L2_UDF_CH0_INT_RAW_V << AXI_DMA_INFIFO_L2_UDF_CH0_INT_RAW_S)
#define AXI_DMA_INFIFO_L2_UDF_CH0_INT_RAW_V  0x00000001U
#define AXI_DMA_INFIFO_L2_UDF_CH0_INT_RAW_S  8
/** AXI_DMA_INFIFO_L3_OVF_CH0_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
 *  overflow.
 */
#define AXI_DMA_INFIFO_L3_OVF_CH0_INT_RAW    (BIT(9))
#define AXI_DMA_INFIFO_L3_OVF_CH0_INT_RAW_M  (AXI_DMA_INFIFO_L3_OVF_CH0_INT_RAW_V << AXI_DMA_INFIFO_L3_OVF_CH0_INT_RAW_S)
#define AXI_DMA_INFIFO_L3_OVF_CH0_INT_RAW_V  0x00000001U
#define AXI_DMA_INFIFO_L3_OVF_CH0_INT_RAW_S  9
/** AXI_DMA_INFIFO_L3_UDF_CH0_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
 *  underflow.
 */
#define AXI_DMA_INFIFO_L3_UDF_CH0_INT_RAW    (BIT(10))
#define AXI_DMA_INFIFO_L3_UDF_CH0_INT_RAW_M  (AXI_DMA_INFIFO_L3_UDF_CH0_INT_RAW_V << AXI_DMA_INFIFO_L3_UDF_CH0_INT_RAW_S)
#define AXI_DMA_INFIFO_L3_UDF_CH0_INT_RAW_V  0x00000001U
#define AXI_DMA_INFIFO_L3_UDF_CH0_INT_RAW_S  10

/** AXI_DMA_IN_INT_ST_CH0_REG register
 *  Masked interrupt of channel 0
 */
#define AXI_DMA_IN_INT_ST_CH0_REG (DR_REG_AXI_DMA_BASE + 0x4)
/** AXI_DMA_IN_DONE_CH0_INT_ST : RO; bitpos: [0]; default: 0;
 *  The raw interrupt status bit for the IN_DONE_CH_INT interrupt.
 */
#define AXI_DMA_IN_DONE_CH0_INT_ST    (BIT(0))
#define AXI_DMA_IN_DONE_CH0_INT_ST_M  (AXI_DMA_IN_DONE_CH0_INT_ST_V << AXI_DMA_IN_DONE_CH0_INT_ST_S)
#define AXI_DMA_IN_DONE_CH0_INT_ST_V  0x00000001U
#define AXI_DMA_IN_DONE_CH0_INT_ST_S  0
/** AXI_DMA_IN_SUC_EOF_CH0_INT_ST : RO; bitpos: [1]; default: 0;
 *  The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.
 */
#define AXI_DMA_IN_SUC_EOF_CH0_INT_ST    (BIT(1))
#define AXI_DMA_IN_SUC_EOF_CH0_INT_ST_M  (AXI_DMA_IN_SUC_EOF_CH0_INT_ST_V << AXI_DMA_IN_SUC_EOF_CH0_INT_ST_S)
#define AXI_DMA_IN_SUC_EOF_CH0_INT_ST_V  0x00000001U
#define AXI_DMA_IN_SUC_EOF_CH0_INT_ST_S  1
/** AXI_DMA_IN_ERR_EOF_CH0_INT_ST : RO; bitpos: [2]; default: 0;
 *  The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt.
 */
#define AXI_DMA_IN_ERR_EOF_CH0_INT_ST    (BIT(2))
#define AXI_DMA_IN_ERR_EOF_CH0_INT_ST_M  (AXI_DMA_IN_ERR_EOF_CH0_INT_ST_V << AXI_DMA_IN_ERR_EOF_CH0_INT_ST_S)
#define AXI_DMA_IN_ERR_EOF_CH0_INT_ST_V  0x00000001U
#define AXI_DMA_IN_ERR_EOF_CH0_INT_ST_S  2
/** AXI_DMA_IN_DSCR_ERR_CH0_INT_ST : RO; bitpos: [3]; default: 0;
 *  The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt.
 */
#define AXI_DMA_IN_DSCR_ERR_CH0_INT_ST    (BIT(3))
#define AXI_DMA_IN_DSCR_ERR_CH0_INT_ST_M  (AXI_DMA_IN_DSCR_ERR_CH0_INT_ST_V << AXI_DMA_IN_DSCR_ERR_CH0_INT_ST_S)
#define AXI_DMA_IN_DSCR_ERR_CH0_INT_ST_V  0x00000001U
#define AXI_DMA_IN_DSCR_ERR_CH0_INT_ST_S  3
/** AXI_DMA_IN_DSCR_EMPTY_CH0_INT_ST : RO; bitpos: [4]; default: 0;
 *  The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt.
 */
#define AXI_DMA_IN_DSCR_EMPTY_CH0_INT_ST    (BIT(4))
#define AXI_DMA_IN_DSCR_EMPTY_CH0_INT_ST_M  (AXI_DMA_IN_DSCR_EMPTY_CH0_INT_ST_V << AXI_DMA_IN_DSCR_EMPTY_CH0_INT_ST_S)
#define AXI_DMA_IN_DSCR_EMPTY_CH0_INT_ST_V  0x00000001U
#define AXI_DMA_IN_DSCR_EMPTY_CH0_INT_ST_S  4
/** AXI_DMA_INFIFO_OVF_CH0_INT_ST : RO; bitpos: [5]; default: 0;
 *  The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_OVF_CH0_INT_ST    (BIT(5))
#define AXI_DMA_INFIFO_OVF_CH0_INT_ST_M  (AXI_DMA_INFIFO_OVF_CH0_INT_ST_V << AXI_DMA_INFIFO_OVF_CH0_INT_ST_S)
#define AXI_DMA_INFIFO_OVF_CH0_INT_ST_V  0x00000001U
#define AXI_DMA_INFIFO_OVF_CH0_INT_ST_S  5
/** AXI_DMA_INFIFO_UDF_CH0_INT_ST : RO; bitpos: [6]; default: 0;
 *  The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_UDF_CH0_INT_ST    (BIT(6))
#define AXI_DMA_INFIFO_UDF_CH0_INT_ST_M  (AXI_DMA_INFIFO_UDF_CH0_INT_ST_V << AXI_DMA_INFIFO_UDF_CH0_INT_ST_S)
#define AXI_DMA_INFIFO_UDF_CH0_INT_ST_V  0x00000001U
#define AXI_DMA_INFIFO_UDF_CH0_INT_ST_S  6
/** AXI_DMA_INFIFO_L1_OVF_CH0_INT_ST : RO; bitpos: [7]; default: 0;
 *  The raw interrupt status bit for the INFIFO_OVF_L2_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L1_OVF_CH0_INT_ST    (BIT(7))
#define AXI_DMA_INFIFO_L1_OVF_CH0_INT_ST_M  (AXI_DMA_INFIFO_L1_OVF_CH0_INT_ST_V << AXI_DMA_INFIFO_L1_OVF_CH0_INT_ST_S)
#define AXI_DMA_INFIFO_L1_OVF_CH0_INT_ST_V  0x00000001U
#define AXI_DMA_INFIFO_L1_OVF_CH0_INT_ST_S  7
/** AXI_DMA_INFIFO_L1_UDF_CH0_INT_ST : RO; bitpos: [8]; default: 0;
 *  The raw interrupt status bit for the INFIFO_UDF_L2_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L1_UDF_CH0_INT_ST    (BIT(8))
#define AXI_DMA_INFIFO_L1_UDF_CH0_INT_ST_M  (AXI_DMA_INFIFO_L1_UDF_CH0_INT_ST_V << AXI_DMA_INFIFO_L1_UDF_CH0_INT_ST_S)
#define AXI_DMA_INFIFO_L1_UDF_CH0_INT_ST_V  0x00000001U
#define AXI_DMA_INFIFO_L1_UDF_CH0_INT_ST_S  8
/** AXI_DMA_INFIFO_L3_OVF_CH0_INT_ST : RO; bitpos: [9]; default: 0;
 *  The raw interrupt status bit for the INFIFO_OVF_L3_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L3_OVF_CH0_INT_ST    (BIT(9))
#define AXI_DMA_INFIFO_L3_OVF_CH0_INT_ST_M  (AXI_DMA_INFIFO_L3_OVF_CH0_INT_ST_V << AXI_DMA_INFIFO_L3_OVF_CH0_INT_ST_S)
#define AXI_DMA_INFIFO_L3_OVF_CH0_INT_ST_V  0x00000001U
#define AXI_DMA_INFIFO_L3_OVF_CH0_INT_ST_S  9
/** AXI_DMA_INFIFO_L3_UDF_CH0_INT_ST : RO; bitpos: [10]; default: 0;
 *  The raw interrupt status bit for the INFIFO_UDF_L3_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L3_UDF_CH0_INT_ST    (BIT(10))
#define AXI_DMA_INFIFO_L3_UDF_CH0_INT_ST_M  (AXI_DMA_INFIFO_L3_UDF_CH0_INT_ST_V << AXI_DMA_INFIFO_L3_UDF_CH0_INT_ST_S)
#define AXI_DMA_INFIFO_L3_UDF_CH0_INT_ST_V  0x00000001U
#define AXI_DMA_INFIFO_L3_UDF_CH0_INT_ST_S  10

/** AXI_DMA_IN_INT_ENA_CH0_REG register
 *  Interrupt enable bits of channel 0
 */
#define AXI_DMA_IN_INT_ENA_CH0_REG (DR_REG_AXI_DMA_BASE + 0x8)
/** AXI_DMA_IN_DONE_CH0_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The interrupt enable bit for the IN_DONE_CH_INT interrupt.
 */
#define AXI_DMA_IN_DONE_CH0_INT_ENA    (BIT(0))
#define AXI_DMA_IN_DONE_CH0_INT_ENA_M  (AXI_DMA_IN_DONE_CH0_INT_ENA_V << AXI_DMA_IN_DONE_CH0_INT_ENA_S)
#define AXI_DMA_IN_DONE_CH0_INT_ENA_V  0x00000001U
#define AXI_DMA_IN_DONE_CH0_INT_ENA_S  0
/** AXI_DMA_IN_SUC_EOF_CH0_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt.
 */
#define AXI_DMA_IN_SUC_EOF_CH0_INT_ENA    (BIT(1))
#define AXI_DMA_IN_SUC_EOF_CH0_INT_ENA_M  (AXI_DMA_IN_SUC_EOF_CH0_INT_ENA_V << AXI_DMA_IN_SUC_EOF_CH0_INT_ENA_S)
#define AXI_DMA_IN_SUC_EOF_CH0_INT_ENA_V  0x00000001U
#define AXI_DMA_IN_SUC_EOF_CH0_INT_ENA_S  1
/** AXI_DMA_IN_ERR_EOF_CH0_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt.
 */
#define AXI_DMA_IN_ERR_EOF_CH0_INT_ENA    (BIT(2))
#define AXI_DMA_IN_ERR_EOF_CH0_INT_ENA_M  (AXI_DMA_IN_ERR_EOF_CH0_INT_ENA_V << AXI_DMA_IN_ERR_EOF_CH0_INT_ENA_S)
#define AXI_DMA_IN_ERR_EOF_CH0_INT_ENA_V  0x00000001U
#define AXI_DMA_IN_ERR_EOF_CH0_INT_ENA_S  2
/** AXI_DMA_IN_DSCR_ERR_CH0_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt.
 */
#define AXI_DMA_IN_DSCR_ERR_CH0_INT_ENA    (BIT(3))
#define AXI_DMA_IN_DSCR_ERR_CH0_INT_ENA_M  (AXI_DMA_IN_DSCR_ERR_CH0_INT_ENA_V << AXI_DMA_IN_DSCR_ERR_CH0_INT_ENA_S)
#define AXI_DMA_IN_DSCR_ERR_CH0_INT_ENA_V  0x00000001U
#define AXI_DMA_IN_DSCR_ERR_CH0_INT_ENA_S  3
/** AXI_DMA_IN_DSCR_EMPTY_CH0_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt.
 */
#define AXI_DMA_IN_DSCR_EMPTY_CH0_INT_ENA    (BIT(4))
#define AXI_DMA_IN_DSCR_EMPTY_CH0_INT_ENA_M  (AXI_DMA_IN_DSCR_EMPTY_CH0_INT_ENA_V << AXI_DMA_IN_DSCR_EMPTY_CH0_INT_ENA_S)
#define AXI_DMA_IN_DSCR_EMPTY_CH0_INT_ENA_V  0x00000001U
#define AXI_DMA_IN_DSCR_EMPTY_CH0_INT_ENA_S  4
/** AXI_DMA_INFIFO_L1_OVF_CH0_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L1_OVF_CH0_INT_ENA    (BIT(5))
#define AXI_DMA_INFIFO_L1_OVF_CH0_INT_ENA_M  (AXI_DMA_INFIFO_L1_OVF_CH0_INT_ENA_V << AXI_DMA_INFIFO_L1_OVF_CH0_INT_ENA_S)
#define AXI_DMA_INFIFO_L1_OVF_CH0_INT_ENA_V  0x00000001U
#define AXI_DMA_INFIFO_L1_OVF_CH0_INT_ENA_S  5
/** AXI_DMA_INFIFO_L1_UDF_CH0_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L1_UDF_CH0_INT_ENA    (BIT(6))
#define AXI_DMA_INFIFO_L1_UDF_CH0_INT_ENA_M  (AXI_DMA_INFIFO_L1_UDF_CH0_INT_ENA_V << AXI_DMA_INFIFO_L1_UDF_CH0_INT_ENA_S)
#define AXI_DMA_INFIFO_L1_UDF_CH0_INT_ENA_V  0x00000001U
#define AXI_DMA_INFIFO_L1_UDF_CH0_INT_ENA_S  6
/** AXI_DMA_INFIFO_L2_OVF_CH0_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  The interrupt enable bit for the INFIFO_OVF_L2_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L2_OVF_CH0_INT_ENA    (BIT(7))
#define AXI_DMA_INFIFO_L2_OVF_CH0_INT_ENA_M  (AXI_DMA_INFIFO_L2_OVF_CH0_INT_ENA_V << AXI_DMA_INFIFO_L2_OVF_CH0_INT_ENA_S)
#define AXI_DMA_INFIFO_L2_OVF_CH0_INT_ENA_V  0x00000001U
#define AXI_DMA_INFIFO_L2_OVF_CH0_INT_ENA_S  7
/** AXI_DMA_INFIFO_L2_UDF_CH0_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  The interrupt enable bit for the INFIFO_UDF_L2_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L2_UDF_CH0_INT_ENA    (BIT(8))
#define AXI_DMA_INFIFO_L2_UDF_CH0_INT_ENA_M  (AXI_DMA_INFIFO_L2_UDF_CH0_INT_ENA_V << AXI_DMA_INFIFO_L2_UDF_CH0_INT_ENA_S)
#define AXI_DMA_INFIFO_L2_UDF_CH0_INT_ENA_V  0x00000001U
#define AXI_DMA_INFIFO_L2_UDF_CH0_INT_ENA_S  8
/** AXI_DMA_INFIFO_L3_OVF_CH0_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  The interrupt enable bit for the INFIFO_OVF_L3_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L3_OVF_CH0_INT_ENA    (BIT(9))
#define AXI_DMA_INFIFO_L3_OVF_CH0_INT_ENA_M  (AXI_DMA_INFIFO_L3_OVF_CH0_INT_ENA_V << AXI_DMA_INFIFO_L3_OVF_CH0_INT_ENA_S)
#define AXI_DMA_INFIFO_L3_OVF_CH0_INT_ENA_V  0x00000001U
#define AXI_DMA_INFIFO_L3_OVF_CH0_INT_ENA_S  9
/** AXI_DMA_INFIFO_L3_UDF_CH0_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  The interrupt enable bit for the INFIFO_UDF_L3_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L3_UDF_CH0_INT_ENA    (BIT(10))
#define AXI_DMA_INFIFO_L3_UDF_CH0_INT_ENA_M  (AXI_DMA_INFIFO_L3_UDF_CH0_INT_ENA_V << AXI_DMA_INFIFO_L3_UDF_CH0_INT_ENA_S)
#define AXI_DMA_INFIFO_L3_UDF_CH0_INT_ENA_V  0x00000001U
#define AXI_DMA_INFIFO_L3_UDF_CH0_INT_ENA_S  10

