espressif/esp-idf/components/soc/esp32s31/register/soc/axi_dma_reg.h
/** AXI_DMA_IN_LINK1_CH1_REG register
 *  Link descriptor configure and control register of Rx channel 1
 */
#define AXI_DMA_IN_LINK1_CH1_REG (DR_REG_AXI_DMA_BASE + 0x88)
/** AXI_DMA_INLINK_AUTO_RET_CH1 : R/W; bitpos: [0]; default: 1;
 *  Set this bit to return to current inlink descriptor's address when there are some
 *  errors in current receiving data.
 */
#define AXI_DMA_INLINK_AUTO_RET_CH1    (BIT(0))
#define AXI_DMA_INLINK_AUTO_RET_CH1_M  (AXI_DMA_INLINK_AUTO_RET_CH1_V << AXI_DMA_INLINK_AUTO_RET_CH1_S)
#define AXI_DMA_INLINK_AUTO_RET_CH1_V  0x00000001U
#define AXI_DMA_INLINK_AUTO_RET_CH1_S  0
/** AXI_DMA_INLINK_STOP_CH1 : WT; bitpos: [1]; default: 0;
 *  Set this bit to stop dealing with the inlink descriptors.
 */
#define AXI_DMA_INLINK_STOP_CH1    (BIT(1))
#define AXI_DMA_INLINK_STOP_CH1_M  (AXI_DMA_INLINK_STOP_CH1_V << AXI_DMA_INLINK_STOP_CH1_S)
#define AXI_DMA_INLINK_STOP_CH1_V  0x00000001U
#define AXI_DMA_INLINK_STOP_CH1_S  1
/** AXI_DMA_INLINK_START_CH1 : WT; bitpos: [2]; default: 0;
 *  Set this bit to start dealing with the inlink descriptors.
 */
#define AXI_DMA_INLINK_START_CH1    (BIT(2))
#define AXI_DMA_INLINK_START_CH1_M  (AXI_DMA_INLINK_START_CH1_V << AXI_DMA_INLINK_START_CH1_S)
#define AXI_DMA_INLINK_START_CH1_V  0x00000001U
#define AXI_DMA_INLINK_START_CH1_S  2
/** AXI_DMA_INLINK_RESTART_CH1 : WT; bitpos: [3]; default: 0;
 *  Set this bit to mount a new inlink descriptor.
 */
#define AXI_DMA_INLINK_RESTART_CH1    (BIT(3))
#define AXI_DMA_INLINK_RESTART_CH1_M  (AXI_DMA_INLINK_RESTART_CH1_V << AXI_DMA_INLINK_RESTART_CH1_S)
#define AXI_DMA_INLINK_RESTART_CH1_V  0x00000001U
#define AXI_DMA_INLINK_RESTART_CH1_S  3
/** AXI_DMA_INLINK_PARK_CH1 : RO; bitpos: [4]; default: 1;
 *  1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is
 *  working.
 */
#define AXI_DMA_INLINK_PARK_CH1    (BIT(4))
#define AXI_DMA_INLINK_PARK_CH1_M  (AXI_DMA_INLINK_PARK_CH1_V << AXI_DMA_INLINK_PARK_CH1_S)
#define AXI_DMA_INLINK_PARK_CH1_V  0x00000001U
#define AXI_DMA_INLINK_PARK_CH1_S  4

/** AXI_DMA_IN_LINK2_CH1_REG register
 *  Link descriptor configure and control register of Rx channel 1
 */
#define AXI_DMA_IN_LINK2_CH1_REG (DR_REG_AXI_DMA_BASE + 0x8c)
/** AXI_DMA_INLINK_ADDR_CH1 : R/W; bitpos: [31:0]; default: 0;
 *  This register stores the 20 least significant bits of the first inlink descriptor's
 *  address.
 */
#define AXI_DMA_INLINK_ADDR_CH1    0xFFFFFFFFU
#define AXI_DMA_INLINK_ADDR_CH1_M  (AXI_DMA_INLINK_ADDR_CH1_V << AXI_DMA_INLINK_ADDR_CH1_S)
#define AXI_DMA_INLINK_ADDR_CH1_V  0xFFFFFFFFU
#define AXI_DMA_INLINK_ADDR_CH1_S  0

/** AXI_DMA_IN_STATE_CH1_REG register
 *  Receive status of Rx channel 1
 */
#define AXI_DMA_IN_STATE_CH1_REG (DR_REG_AXI_DMA_BASE + 0x90)
/** AXI_DMA_INLINK_DSCR_ADDR_CH1 : RO; bitpos: [17:0]; default: 0;
 *  This register stores the current inlink descriptor's address.
 */
#define AXI_DMA_INLINK_DSCR_ADDR_CH1    0x0003FFFFU
#define AXI_DMA_INLINK_DSCR_ADDR_CH1_M  (AXI_DMA_INLINK_DSCR_ADDR_CH1_V << AXI_DMA_INLINK_DSCR_ADDR_CH1_S)
#define AXI_DMA_INLINK_DSCR_ADDR_CH1_V  0x0003FFFFU
#define AXI_DMA_INLINK_DSCR_ADDR_CH1_S  0
/** AXI_DMA_IN_DSCR_STATE_CH1 : RO; bitpos: [19:18]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_DSCR_STATE_CH1    0x00000003U
#define AXI_DMA_IN_DSCR_STATE_CH1_M  (AXI_DMA_IN_DSCR_STATE_CH1_V << AXI_DMA_IN_DSCR_STATE_CH1_S)
#define AXI_DMA_IN_DSCR_STATE_CH1_V  0x00000003U
#define AXI_DMA_IN_DSCR_STATE_CH1_S  18
/** AXI_DMA_IN_STATE_CH1 : RO; bitpos: [22:20]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_STATE_CH1    0x00000007U
#define AXI_DMA_IN_STATE_CH1_M  (AXI_DMA_IN_STATE_CH1_V << AXI_DMA_IN_STATE_CH1_S)
#define AXI_DMA_IN_STATE_CH1_V  0x00000007U
#define AXI_DMA_IN_STATE_CH1_S  20

/** AXI_DMA_IN_SUC_EOF_DES_ADDR_CH1_REG register
 *  Inlink descriptor address when EOF occurs of Rx channel 1
 */
#define AXI_DMA_IN_SUC_EOF_DES_ADDR_CH1_REG (DR_REG_AXI_DMA_BASE + 0x94)
/** AXI_DMA_IN_SUC_EOF_DES_ADDR_CH1 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the inlink descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define AXI_DMA_IN_SUC_EOF_DES_ADDR_CH1    0xFFFFFFFFU
#define AXI_DMA_IN_SUC_EOF_DES_ADDR_CH1_M  (AXI_DMA_IN_SUC_EOF_DES_ADDR_CH1_V << AXI_DMA_IN_SUC_EOF_DES_ADDR_CH1_S)
#define AXI_DMA_IN_SUC_EOF_DES_ADDR_CH1_V  0xFFFFFFFFU
#define AXI_DMA_IN_SUC_EOF_DES_ADDR_CH1_S  0

/** AXI_DMA_IN_ERR_EOF_DES_ADDR_CH1_REG register
 *  Inlink descriptor address when errors occur of Rx channel 1
 */
#define AXI_DMA_IN_ERR_EOF_DES_ADDR_CH1_REG (DR_REG_AXI_DMA_BASE + 0x98)
/** AXI_DMA_IN_ERR_EOF_DES_ADDR_CH1 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the inlink descriptor when there are some
 *  errors in current receiving data. Only used when peripheral is UHCI0.
 */
#define AXI_DMA_IN_ERR_EOF_DES_ADDR_CH1    0xFFFFFFFFU
#define AXI_DMA_IN_ERR_EOF_DES_ADDR_CH1_M  (AXI_DMA_IN_ERR_EOF_DES_ADDR_CH1_V << AXI_DMA_IN_ERR_EOF_DES_ADDR_CH1_S)
#define AXI_DMA_IN_ERR_EOF_DES_ADDR_CH1_V  0xFFFFFFFFU
#define AXI_DMA_IN_ERR_EOF_DES_ADDR_CH1_S  0

/** AXI_DMA_IN_DSCR_CH1_REG register
 *  Current inlink descriptor address of Rx channel 1
 */
#define AXI_DMA_IN_DSCR_CH1_REG (DR_REG_AXI_DMA_BASE + 0x9c)
/** AXI_DMA_INLINK_DSCR_CH1 : RO; bitpos: [31:0]; default: 0;
 *  The address of the current inlink descriptor x.
 */
#define AXI_DMA_INLINK_DSCR_CH1    0xFFFFFFFFU
#define AXI_DMA_INLINK_DSCR_CH1_M  (AXI_DMA_INLINK_DSCR_CH1_V << AXI_DMA_INLINK_DSCR_CH1_S)
#define AXI_DMA_INLINK_DSCR_CH1_V  0xFFFFFFFFU
#define AXI_DMA_INLINK_DSCR_CH1_S  0

/** AXI_DMA_IN_DSCR_BF0_CH1_REG register
 *  The last inlink descriptor address of Rx channel 1
 */
#define AXI_DMA_IN_DSCR_BF0_CH1_REG (DR_REG_AXI_DMA_BASE + 0xa0)
/** AXI_DMA_INLINK_DSCR_BF0_CH1 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last inlink descriptor x-1.
 */
#define AXI_DMA_INLINK_DSCR_BF0_CH1    0xFFFFFFFFU
#define AXI_DMA_INLINK_DSCR_BF0_CH1_M  (AXI_DMA_INLINK_DSCR_BF0_CH1_V << AXI_DMA_INLINK_DSCR_BF0_CH1_S)
#define AXI_DMA_INLINK_DSCR_BF0_CH1_V  0xFFFFFFFFU
#define AXI_DMA_INLINK_DSCR_BF0_CH1_S  0

/** AXI_DMA_IN_DSCR_BF1_CH1_REG register
 *  The second-to-last inlink descriptor address of Rx channel 1
 */
#define AXI_DMA_IN_DSCR_BF1_CH1_REG (DR_REG_AXI_DMA_BASE + 0xa4)
/** AXI_DMA_INLINK_DSCR_BF1_CH1 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last inlink descriptor x-2.
 */
#define AXI_DMA_INLINK_DSCR_BF1_CH1    0xFFFFFFFFU
#define AXI_DMA_INLINK_DSCR_BF1_CH1_M  (AXI_DMA_INLINK_DSCR_BF1_CH1_V << AXI_DMA_INLINK_DSCR_BF1_CH1_S)
#define AXI_DMA_INLINK_DSCR_BF1_CH1_V  0xFFFFFFFFU
#define AXI_DMA_INLINK_DSCR_BF1_CH1_S  0

/** AXI_DMA_IN_PRI_CH1_REG register
 *  Priority register of Rx channel 1
 */
#define AXI_DMA_IN_PRI_CH1_REG (DR_REG_AXI_DMA_BASE + 0xa8)
/** AXI_DMA_RX_PRI_CH1 : R/W; bitpos: [3:0]; default: 0;
 *  The priority of Rx channel 0. The larger of the value the higher of the priority.
 */
#define AXI_DMA_RX_PRI_CH1    0x0000000FU
#define AXI_DMA_RX_PRI_CH1_M  (AXI_DMA_RX_PRI_CH1_V << AXI_DMA_RX_PRI_CH1_S)
#define AXI_DMA_RX_PRI_CH1_V  0x0000000FU
#define AXI_DMA_RX_PRI_CH1_S  0
/** AXI_DMA_RX_CH_ARB_WEIGH_CH1 : R/W; bitpos: [7:4]; default: 0;
 *  The weight of Rx channel 0
 */
#define AXI_DMA_RX_CH_ARB_WEIGH_CH1    0x0000000FU
#define AXI_DMA_RX_CH_ARB_WEIGH_CH1_M  (AXI_DMA_RX_CH_ARB_WEIGH_CH1_V << AXI_DMA_RX_CH_ARB_WEIGH_CH1_S)
#define AXI_DMA_RX_CH_ARB_WEIGH_CH1_V  0x0000000FU
#define AXI_DMA_RX_CH_ARB_WEIGH_CH1_S  4
/** AXI_DMA_RX_ARB_WEIGH_OPT_DIR_CH1 : R/W; bitpos: [8]; default: 0;
 *  0: mean not optimization weight function ,1: mean optimization
 */
#define AXI_DMA_RX_ARB_WEIGH_OPT_DIR_CH1    (BIT(8))
#define AXI_DMA_RX_ARB_WEIGH_OPT_DIR_CH1_M  (AXI_DMA_RX_ARB_WEIGH_OPT_DIR_CH1_V << AXI_DMA_RX_ARB_WEIGH_OPT_DIR_CH1_S)
#define AXI_DMA_RX_ARB_WEIGH_OPT_DIR_CH1_V  0x00000001U
#define AXI_DMA_RX_ARB_WEIGH_OPT_DIR_CH1_S  8

/** AXI_DMA_IN_PERI_SEL_CH1_REG register
 *  Peripheral selection of Rx channel 1
 */
#define AXI_DMA_IN_PERI_SEL_CH1_REG (DR_REG_AXI_DMA_BASE + 0xac)
/** AXI_DMA_PERI_IN_SEL_CH1 : R/W; bitpos: [5:0]; default: 63;
 *  This register is used to select peripheral for Rx channel 0. 0:lcdcam. 1: gpspi_2.
 *  2: gpspi_3. 3: parl_io. 4: aes. 5: sha. 6~15: Dummy
 */
#define AXI_DMA_PERI_IN_SEL_CH1    0x0000003FU
#define AXI_DMA_PERI_IN_SEL_CH1_M  (AXI_DMA_PERI_IN_SEL_CH1_V << AXI_DMA_PERI_IN_SEL_CH1_S)
#define AXI_DMA_PERI_IN_SEL_CH1_V  0x0000003FU
#define AXI_DMA_PERI_IN_SEL_CH1_S  0

/** AXI_DMA_IN_INT_RAW_CH2_REG register
 *  Raw status interrupt of channel 2
 */
#define AXI_DMA_IN_INT_RAW_CH2_REG (DR_REG_AXI_DMA_BASE + 0xd0)
/** AXI_DMA_IN_DONE_CH2_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been received for Rx channel 0.
 */
#define AXI_DMA_IN_DONE_CH2_INT_RAW    (BIT(0))
#define AXI_DMA_IN_DONE_CH2_INT_RAW_M  (AXI_DMA_IN_DONE_CH2_INT_RAW_V << AXI_DMA_IN_DONE_CH2_INT_RAW_S)
#define AXI_DMA_IN_DONE_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_IN_DONE_CH2_INT_RAW_S  0
/** AXI_DMA_IN_SUC_EOF_CH2_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one inlink
 *  descriptor has been received for Rx channel 0. For UHCI0 the raw interrupt bit
 *  turns to high level when the last data pointed by one inlink descriptor has been
 *  received and no data error is detected for Rx channel 0.
 */
#define AXI_DMA_IN_SUC_EOF_CH2_INT_RAW    (BIT(1))
#define AXI_DMA_IN_SUC_EOF_CH2_INT_RAW_M  (AXI_DMA_IN_SUC_EOF_CH2_INT_RAW_V << AXI_DMA_IN_SUC_EOF_CH2_INT_RAW_S)
#define AXI_DMA_IN_SUC_EOF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_IN_SUC_EOF_CH2_INT_RAW_S  1
/** AXI_DMA_IN_ERR_EOF_CH2_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt bit turns to high level when data error is detected only in the
 *  case that the peripheral is UHCI0 for Rx channel 0. For other peripherals this raw
 *  interrupt is reserved.
 */
#define AXI_DMA_IN_ERR_EOF_CH2_INT_RAW    (BIT(2))
#define AXI_DMA_IN_ERR_EOF_CH2_INT_RAW_M  (AXI_DMA_IN_ERR_EOF_CH2_INT_RAW_V << AXI_DMA_IN_ERR_EOF_CH2_INT_RAW_S)
#define AXI_DMA_IN_ERR_EOF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_IN_ERR_EOF_CH2_INT_RAW_S  2
/** AXI_DMA_IN_DSCR_ERR_CH2_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt bit turns to high level when detecting inlink descriptor error
 *  including owner error and the second and third word error of inlink descriptor for
 *  Rx channel 0.
 */
#define AXI_DMA_IN_DSCR_ERR_CH2_INT_RAW    (BIT(3))
#define AXI_DMA_IN_DSCR_ERR_CH2_INT_RAW_M  (AXI_DMA_IN_DSCR_ERR_CH2_INT_RAW_V << AXI_DMA_IN_DSCR_ERR_CH2_INT_RAW_S)
#define AXI_DMA_IN_DSCR_ERR_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_IN_DSCR_ERR_CH2_INT_RAW_S  3
/** AXI_DMA_IN_DSCR_EMPTY_CH2_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw interrupt bit turns to high level when Rx buffer pointed by inlink is full
 *  and receiving data is not completed but there is no more inlink for Rx channel 0.
 */
#define AXI_DMA_IN_DSCR_EMPTY_CH2_INT_RAW    (BIT(4))
#define AXI_DMA_IN_DSCR_EMPTY_CH2_INT_RAW_M  (AXI_DMA_IN_DSCR_EMPTY_CH2_INT_RAW_V << AXI_DMA_IN_DSCR_EMPTY_CH2_INT_RAW_S)
#define AXI_DMA_IN_DSCR_EMPTY_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_IN_DSCR_EMPTY_CH2_INT_RAW_S  4
/** AXI_DMA_INFIFO_L1_OVF_CH2_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
 *  overflow.
 */
#define AXI_DMA_INFIFO_L1_OVF_CH2_INT_RAW    (BIT(5))
#define AXI_DMA_INFIFO_L1_OVF_CH2_INT_RAW_M  (AXI_DMA_INFIFO_L1_OVF_CH2_INT_RAW_V << AXI_DMA_INFIFO_L1_OVF_CH2_INT_RAW_S)
#define AXI_DMA_INFIFO_L1_OVF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_INFIFO_L1_OVF_CH2_INT_RAW_S  5
/** AXI_DMA_INFIFO_L1_UDF_CH2_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
 *  underflow.
 */
#define AXI_DMA_INFIFO_L1_UDF_CH2_INT_RAW    (BIT(6))
#define AXI_DMA_INFIFO_L1_UDF_CH2_INT_RAW_M  (AXI_DMA_INFIFO_L1_UDF_CH2_INT_RAW_V << AXI_DMA_INFIFO_L1_UDF_CH2_INT_RAW_S)
#define AXI_DMA_INFIFO_L1_UDF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_INFIFO_L1_UDF_CH2_INT_RAW_S  6
/** AXI_DMA_INFIFO_L2_OVF_CH2_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
 *  overflow.
 */
#define AXI_DMA_INFIFO_L2_OVF_CH2_INT_RAW    (BIT(7))
#define AXI_DMA_INFIFO_L2_OVF_CH2_INT_RAW_M  (AXI_DMA_INFIFO_L2_OVF_CH2_INT_RAW_V << AXI_DMA_INFIFO_L2_OVF_CH2_INT_RAW_S)
#define AXI_DMA_INFIFO_L2_OVF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_INFIFO_L2_OVF_CH2_INT_RAW_S  7
/** AXI_DMA_INFIFO_L2_UDF_CH2_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
 *  underflow.
 */
#define AXI_DMA_INFIFO_L2_UDF_CH2_INT_RAW    (BIT(8))
#define AXI_DMA_INFIFO_L2_UDF_CH2_INT_RAW_M  (AXI_DMA_INFIFO_L2_UDF_CH2_INT_RAW_V << AXI_DMA_INFIFO_L2_UDF_CH2_INT_RAW_S)
#define AXI_DMA_INFIFO_L2_UDF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_INFIFO_L2_UDF_CH2_INT_RAW_S  8
/** AXI_DMA_INFIFO_L3_OVF_CH2_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
 *  overflow.
 */
#define AXI_DMA_INFIFO_L3_OVF_CH2_INT_RAW    (BIT(9))
#define AXI_DMA_INFIFO_L3_OVF_CH2_INT_RAW_M  (AXI_DMA_INFIFO_L3_OVF_CH2_INT_RAW_V << AXI_DMA_INFIFO_L3_OVF_CH2_INT_RAW_S)
#define AXI_DMA_INFIFO_L3_OVF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_INFIFO_L3_OVF_CH2_INT_RAW_S  9
/** AXI_DMA_INFIFO_L3_UDF_CH2_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is
 *  underflow.
 */
#define AXI_DMA_INFIFO_L3_UDF_CH2_INT_RAW    (BIT(10))
#define AXI_DMA_INFIFO_L3_UDF_CH2_INT_RAW_M  (AXI_DMA_INFIFO_L3_UDF_CH2_INT_RAW_V << AXI_DMA_INFIFO_L3_UDF_CH2_INT_RAW_S)
#define AXI_DMA_INFIFO_L3_UDF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_INFIFO_L3_UDF_CH2_INT_RAW_S  10

