espressif/esp-idf/components/soc/esp32s31/register/soc/axi_dma_reg.h
/** AXI_DMA_IN_INT_ST_CH2_REG register
 *  Masked interrupt of channel 2
 */
#define AXI_DMA_IN_INT_ST_CH2_REG (DR_REG_AXI_DMA_BASE + 0xd4)
/** AXI_DMA_IN_DONE_CH2_INT_ST : RO; bitpos: [0]; default: 0;
 *  The raw interrupt status bit for the IN_DONE_CH_INT interrupt.
 */
#define AXI_DMA_IN_DONE_CH2_INT_ST    (BIT(0))
#define AXI_DMA_IN_DONE_CH2_INT_ST_M  (AXI_DMA_IN_DONE_CH2_INT_ST_V << AXI_DMA_IN_DONE_CH2_INT_ST_S)
#define AXI_DMA_IN_DONE_CH2_INT_ST_V  0x00000001U
#define AXI_DMA_IN_DONE_CH2_INT_ST_S  0
/** AXI_DMA_IN_SUC_EOF_CH2_INT_ST : RO; bitpos: [1]; default: 0;
 *  The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.
 */
#define AXI_DMA_IN_SUC_EOF_CH2_INT_ST    (BIT(1))
#define AXI_DMA_IN_SUC_EOF_CH2_INT_ST_M  (AXI_DMA_IN_SUC_EOF_CH2_INT_ST_V << AXI_DMA_IN_SUC_EOF_CH2_INT_ST_S)
#define AXI_DMA_IN_SUC_EOF_CH2_INT_ST_V  0x00000001U
#define AXI_DMA_IN_SUC_EOF_CH2_INT_ST_S  1
/** AXI_DMA_IN_ERR_EOF_CH2_INT_ST : RO; bitpos: [2]; default: 0;
 *  The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt.
 */
#define AXI_DMA_IN_ERR_EOF_CH2_INT_ST    (BIT(2))
#define AXI_DMA_IN_ERR_EOF_CH2_INT_ST_M  (AXI_DMA_IN_ERR_EOF_CH2_INT_ST_V << AXI_DMA_IN_ERR_EOF_CH2_INT_ST_S)
#define AXI_DMA_IN_ERR_EOF_CH2_INT_ST_V  0x00000001U
#define AXI_DMA_IN_ERR_EOF_CH2_INT_ST_S  2
/** AXI_DMA_IN_DSCR_ERR_CH2_INT_ST : RO; bitpos: [3]; default: 0;
 *  The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt.
 */
#define AXI_DMA_IN_DSCR_ERR_CH2_INT_ST    (BIT(3))
#define AXI_DMA_IN_DSCR_ERR_CH2_INT_ST_M  (AXI_DMA_IN_DSCR_ERR_CH2_INT_ST_V << AXI_DMA_IN_DSCR_ERR_CH2_INT_ST_S)
#define AXI_DMA_IN_DSCR_ERR_CH2_INT_ST_V  0x00000001U
#define AXI_DMA_IN_DSCR_ERR_CH2_INT_ST_S  3
/** AXI_DMA_IN_DSCR_EMPTY_CH2_INT_ST : RO; bitpos: [4]; default: 0;
 *  The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt.
 */
#define AXI_DMA_IN_DSCR_EMPTY_CH2_INT_ST    (BIT(4))
#define AXI_DMA_IN_DSCR_EMPTY_CH2_INT_ST_M  (AXI_DMA_IN_DSCR_EMPTY_CH2_INT_ST_V << AXI_DMA_IN_DSCR_EMPTY_CH2_INT_ST_S)
#define AXI_DMA_IN_DSCR_EMPTY_CH2_INT_ST_V  0x00000001U
#define AXI_DMA_IN_DSCR_EMPTY_CH2_INT_ST_S  4
/** AXI_DMA_INFIFO_OVF_CH2_INT_ST : RO; bitpos: [5]; default: 0;
 *  The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_OVF_CH2_INT_ST    (BIT(5))
#define AXI_DMA_INFIFO_OVF_CH2_INT_ST_M  (AXI_DMA_INFIFO_OVF_CH2_INT_ST_V << AXI_DMA_INFIFO_OVF_CH2_INT_ST_S)
#define AXI_DMA_INFIFO_OVF_CH2_INT_ST_V  0x00000001U
#define AXI_DMA_INFIFO_OVF_CH2_INT_ST_S  5
/** AXI_DMA_INFIFO_UDF_CH2_INT_ST : RO; bitpos: [6]; default: 0;
 *  The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_UDF_CH2_INT_ST    (BIT(6))
#define AXI_DMA_INFIFO_UDF_CH2_INT_ST_M  (AXI_DMA_INFIFO_UDF_CH2_INT_ST_V << AXI_DMA_INFIFO_UDF_CH2_INT_ST_S)
#define AXI_DMA_INFIFO_UDF_CH2_INT_ST_V  0x00000001U
#define AXI_DMA_INFIFO_UDF_CH2_INT_ST_S  6
/** AXI_DMA_INFIFO_L1_OVF_CH2_INT_ST : RO; bitpos: [7]; default: 0;
 *  The raw interrupt status bit for the INFIFO_OVF_L2_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L1_OVF_CH2_INT_ST    (BIT(7))
#define AXI_DMA_INFIFO_L1_OVF_CH2_INT_ST_M  (AXI_DMA_INFIFO_L1_OVF_CH2_INT_ST_V << AXI_DMA_INFIFO_L1_OVF_CH2_INT_ST_S)
#define AXI_DMA_INFIFO_L1_OVF_CH2_INT_ST_V  0x00000001U
#define AXI_DMA_INFIFO_L1_OVF_CH2_INT_ST_S  7
/** AXI_DMA_INFIFO_L1_UDF_CH2_INT_ST : RO; bitpos: [8]; default: 0;
 *  The raw interrupt status bit for the INFIFO_UDF_L2_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L1_UDF_CH2_INT_ST    (BIT(8))
#define AXI_DMA_INFIFO_L1_UDF_CH2_INT_ST_M  (AXI_DMA_INFIFO_L1_UDF_CH2_INT_ST_V << AXI_DMA_INFIFO_L1_UDF_CH2_INT_ST_S)
#define AXI_DMA_INFIFO_L1_UDF_CH2_INT_ST_V  0x00000001U
#define AXI_DMA_INFIFO_L1_UDF_CH2_INT_ST_S  8
/** AXI_DMA_INFIFO_L3_OVF_CH2_INT_ST : RO; bitpos: [9]; default: 0;
 *  The raw interrupt status bit for the INFIFO_OVF_L3_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L3_OVF_CH2_INT_ST    (BIT(9))
#define AXI_DMA_INFIFO_L3_OVF_CH2_INT_ST_M  (AXI_DMA_INFIFO_L3_OVF_CH2_INT_ST_V << AXI_DMA_INFIFO_L3_OVF_CH2_INT_ST_S)
#define AXI_DMA_INFIFO_L3_OVF_CH2_INT_ST_V  0x00000001U
#define AXI_DMA_INFIFO_L3_OVF_CH2_INT_ST_S  9
/** AXI_DMA_INFIFO_L3_UDF_CH2_INT_ST : RO; bitpos: [10]; default: 0;
 *  The raw interrupt status bit for the INFIFO_UDF_L3_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L3_UDF_CH2_INT_ST    (BIT(10))
#define AXI_DMA_INFIFO_L3_UDF_CH2_INT_ST_M  (AXI_DMA_INFIFO_L3_UDF_CH2_INT_ST_V << AXI_DMA_INFIFO_L3_UDF_CH2_INT_ST_S)
#define AXI_DMA_INFIFO_L3_UDF_CH2_INT_ST_V  0x00000001U
#define AXI_DMA_INFIFO_L3_UDF_CH2_INT_ST_S  10

/** AXI_DMA_IN_INT_ENA_CH2_REG register
 *  Interrupt enable bits of channel 2
 */
#define AXI_DMA_IN_INT_ENA_CH2_REG (DR_REG_AXI_DMA_BASE + 0xd8)
/** AXI_DMA_IN_DONE_CH2_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The interrupt enable bit for the IN_DONE_CH_INT interrupt.
 */
#define AXI_DMA_IN_DONE_CH2_INT_ENA    (BIT(0))
#define AXI_DMA_IN_DONE_CH2_INT_ENA_M  (AXI_DMA_IN_DONE_CH2_INT_ENA_V << AXI_DMA_IN_DONE_CH2_INT_ENA_S)
#define AXI_DMA_IN_DONE_CH2_INT_ENA_V  0x00000001U
#define AXI_DMA_IN_DONE_CH2_INT_ENA_S  0
/** AXI_DMA_IN_SUC_EOF_CH2_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt.
 */
#define AXI_DMA_IN_SUC_EOF_CH2_INT_ENA    (BIT(1))
#define AXI_DMA_IN_SUC_EOF_CH2_INT_ENA_M  (AXI_DMA_IN_SUC_EOF_CH2_INT_ENA_V << AXI_DMA_IN_SUC_EOF_CH2_INT_ENA_S)
#define AXI_DMA_IN_SUC_EOF_CH2_INT_ENA_V  0x00000001U
#define AXI_DMA_IN_SUC_EOF_CH2_INT_ENA_S  1
/** AXI_DMA_IN_ERR_EOF_CH2_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt.
 */
#define AXI_DMA_IN_ERR_EOF_CH2_INT_ENA    (BIT(2))
#define AXI_DMA_IN_ERR_EOF_CH2_INT_ENA_M  (AXI_DMA_IN_ERR_EOF_CH2_INT_ENA_V << AXI_DMA_IN_ERR_EOF_CH2_INT_ENA_S)
#define AXI_DMA_IN_ERR_EOF_CH2_INT_ENA_V  0x00000001U
#define AXI_DMA_IN_ERR_EOF_CH2_INT_ENA_S  2
/** AXI_DMA_IN_DSCR_ERR_CH2_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt.
 */
#define AXI_DMA_IN_DSCR_ERR_CH2_INT_ENA    (BIT(3))
#define AXI_DMA_IN_DSCR_ERR_CH2_INT_ENA_M  (AXI_DMA_IN_DSCR_ERR_CH2_INT_ENA_V << AXI_DMA_IN_DSCR_ERR_CH2_INT_ENA_S)
#define AXI_DMA_IN_DSCR_ERR_CH2_INT_ENA_V  0x00000001U
#define AXI_DMA_IN_DSCR_ERR_CH2_INT_ENA_S  3
/** AXI_DMA_IN_DSCR_EMPTY_CH2_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt.
 */
#define AXI_DMA_IN_DSCR_EMPTY_CH2_INT_ENA    (BIT(4))
#define AXI_DMA_IN_DSCR_EMPTY_CH2_INT_ENA_M  (AXI_DMA_IN_DSCR_EMPTY_CH2_INT_ENA_V << AXI_DMA_IN_DSCR_EMPTY_CH2_INT_ENA_S)
#define AXI_DMA_IN_DSCR_EMPTY_CH2_INT_ENA_V  0x00000001U
#define AXI_DMA_IN_DSCR_EMPTY_CH2_INT_ENA_S  4
/** AXI_DMA_INFIFO_L1_OVF_CH2_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L1_OVF_CH2_INT_ENA    (BIT(5))
#define AXI_DMA_INFIFO_L1_OVF_CH2_INT_ENA_M  (AXI_DMA_INFIFO_L1_OVF_CH2_INT_ENA_V << AXI_DMA_INFIFO_L1_OVF_CH2_INT_ENA_S)
#define AXI_DMA_INFIFO_L1_OVF_CH2_INT_ENA_V  0x00000001U
#define AXI_DMA_INFIFO_L1_OVF_CH2_INT_ENA_S  5
/** AXI_DMA_INFIFO_L1_UDF_CH2_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L1_UDF_CH2_INT_ENA    (BIT(6))
#define AXI_DMA_INFIFO_L1_UDF_CH2_INT_ENA_M  (AXI_DMA_INFIFO_L1_UDF_CH2_INT_ENA_V << AXI_DMA_INFIFO_L1_UDF_CH2_INT_ENA_S)
#define AXI_DMA_INFIFO_L1_UDF_CH2_INT_ENA_V  0x00000001U
#define AXI_DMA_INFIFO_L1_UDF_CH2_INT_ENA_S  6
/** AXI_DMA_INFIFO_L2_OVF_CH2_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  The interrupt enable bit for the INFIFO_OVF_L2_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L2_OVF_CH2_INT_ENA    (BIT(7))
#define AXI_DMA_INFIFO_L2_OVF_CH2_INT_ENA_M  (AXI_DMA_INFIFO_L2_OVF_CH2_INT_ENA_V << AXI_DMA_INFIFO_L2_OVF_CH2_INT_ENA_S)
#define AXI_DMA_INFIFO_L2_OVF_CH2_INT_ENA_V  0x00000001U
#define AXI_DMA_INFIFO_L2_OVF_CH2_INT_ENA_S  7
/** AXI_DMA_INFIFO_L2_UDF_CH2_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  The interrupt enable bit for the INFIFO_UDF_L2_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L2_UDF_CH2_INT_ENA    (BIT(8))
#define AXI_DMA_INFIFO_L2_UDF_CH2_INT_ENA_M  (AXI_DMA_INFIFO_L2_UDF_CH2_INT_ENA_V << AXI_DMA_INFIFO_L2_UDF_CH2_INT_ENA_S)
#define AXI_DMA_INFIFO_L2_UDF_CH2_INT_ENA_V  0x00000001U
#define AXI_DMA_INFIFO_L2_UDF_CH2_INT_ENA_S  8
/** AXI_DMA_INFIFO_L3_OVF_CH2_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  The interrupt enable bit for the INFIFO_OVF_L3_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L3_OVF_CH2_INT_ENA    (BIT(9))
#define AXI_DMA_INFIFO_L3_OVF_CH2_INT_ENA_M  (AXI_DMA_INFIFO_L3_OVF_CH2_INT_ENA_V << AXI_DMA_INFIFO_L3_OVF_CH2_INT_ENA_S)
#define AXI_DMA_INFIFO_L3_OVF_CH2_INT_ENA_V  0x00000001U
#define AXI_DMA_INFIFO_L3_OVF_CH2_INT_ENA_S  9
/** AXI_DMA_INFIFO_L3_UDF_CH2_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  The interrupt enable bit for the INFIFO_UDF_L3_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L3_UDF_CH2_INT_ENA    (BIT(10))
#define AXI_DMA_INFIFO_L3_UDF_CH2_INT_ENA_M  (AXI_DMA_INFIFO_L3_UDF_CH2_INT_ENA_V << AXI_DMA_INFIFO_L3_UDF_CH2_INT_ENA_S)
#define AXI_DMA_INFIFO_L3_UDF_CH2_INT_ENA_V  0x00000001U
#define AXI_DMA_INFIFO_L3_UDF_CH2_INT_ENA_S  10

/** AXI_DMA_IN_INT_CLR_CH2_REG register
 *  Interrupt clear bits of channel 2
 */
#define AXI_DMA_IN_INT_CLR_CH2_REG (DR_REG_AXI_DMA_BASE + 0xdc)
/** AXI_DMA_IN_DONE_CH2_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear the IN_DONE_CH_INT interrupt.
 */
#define AXI_DMA_IN_DONE_CH2_INT_CLR    (BIT(0))
#define AXI_DMA_IN_DONE_CH2_INT_CLR_M  (AXI_DMA_IN_DONE_CH2_INT_CLR_V << AXI_DMA_IN_DONE_CH2_INT_CLR_S)
#define AXI_DMA_IN_DONE_CH2_INT_CLR_V  0x00000001U
#define AXI_DMA_IN_DONE_CH2_INT_CLR_S  0
/** AXI_DMA_IN_SUC_EOF_CH2_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.
 */
#define AXI_DMA_IN_SUC_EOF_CH2_INT_CLR    (BIT(1))
#define AXI_DMA_IN_SUC_EOF_CH2_INT_CLR_M  (AXI_DMA_IN_SUC_EOF_CH2_INT_CLR_V << AXI_DMA_IN_SUC_EOF_CH2_INT_CLR_S)
#define AXI_DMA_IN_SUC_EOF_CH2_INT_CLR_V  0x00000001U
#define AXI_DMA_IN_SUC_EOF_CH2_INT_CLR_S  1
/** AXI_DMA_IN_ERR_EOF_CH2_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.
 */
#define AXI_DMA_IN_ERR_EOF_CH2_INT_CLR    (BIT(2))
#define AXI_DMA_IN_ERR_EOF_CH2_INT_CLR_M  (AXI_DMA_IN_ERR_EOF_CH2_INT_CLR_V << AXI_DMA_IN_ERR_EOF_CH2_INT_CLR_S)
#define AXI_DMA_IN_ERR_EOF_CH2_INT_CLR_V  0x00000001U
#define AXI_DMA_IN_ERR_EOF_CH2_INT_CLR_S  2
/** AXI_DMA_IN_DSCR_ERR_CH2_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear the IN_DSCR_ERR_CH_INT interrupt.
 */
#define AXI_DMA_IN_DSCR_ERR_CH2_INT_CLR    (BIT(3))
#define AXI_DMA_IN_DSCR_ERR_CH2_INT_CLR_M  (AXI_DMA_IN_DSCR_ERR_CH2_INT_CLR_V << AXI_DMA_IN_DSCR_ERR_CH2_INT_CLR_S)
#define AXI_DMA_IN_DSCR_ERR_CH2_INT_CLR_V  0x00000001U
#define AXI_DMA_IN_DSCR_ERR_CH2_INT_CLR_S  3
/** AXI_DMA_IN_DSCR_EMPTY_CH2_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.
 */
#define AXI_DMA_IN_DSCR_EMPTY_CH2_INT_CLR    (BIT(4))
#define AXI_DMA_IN_DSCR_EMPTY_CH2_INT_CLR_M  (AXI_DMA_IN_DSCR_EMPTY_CH2_INT_CLR_V << AXI_DMA_IN_DSCR_EMPTY_CH2_INT_CLR_S)
#define AXI_DMA_IN_DSCR_EMPTY_CH2_INT_CLR_V  0x00000001U
#define AXI_DMA_IN_DSCR_EMPTY_CH2_INT_CLR_S  4
/** AXI_DMA_INFIFO_L1_OVF_CH2_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L1_OVF_CH2_INT_CLR    (BIT(5))
#define AXI_DMA_INFIFO_L1_OVF_CH2_INT_CLR_M  (AXI_DMA_INFIFO_L1_OVF_CH2_INT_CLR_V << AXI_DMA_INFIFO_L1_OVF_CH2_INT_CLR_S)
#define AXI_DMA_INFIFO_L1_OVF_CH2_INT_CLR_V  0x00000001U
#define AXI_DMA_INFIFO_L1_OVF_CH2_INT_CLR_S  5
/** AXI_DMA_INFIFO_L1_UDF_CH2_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L1_UDF_CH2_INT_CLR    (BIT(6))
#define AXI_DMA_INFIFO_L1_UDF_CH2_INT_CLR_M  (AXI_DMA_INFIFO_L1_UDF_CH2_INT_CLR_V << AXI_DMA_INFIFO_L1_UDF_CH2_INT_CLR_S)
#define AXI_DMA_INFIFO_L1_UDF_CH2_INT_CLR_V  0x00000001U
#define AXI_DMA_INFIFO_L1_UDF_CH2_INT_CLR_S  6
/** AXI_DMA_INFIFO_L2_OVF_CH2_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Set this bit to clear the INFIFO_OVF_L2_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L2_OVF_CH2_INT_CLR    (BIT(7))
#define AXI_DMA_INFIFO_L2_OVF_CH2_INT_CLR_M  (AXI_DMA_INFIFO_L2_OVF_CH2_INT_CLR_V << AXI_DMA_INFIFO_L2_OVF_CH2_INT_CLR_S)
#define AXI_DMA_INFIFO_L2_OVF_CH2_INT_CLR_V  0x00000001U
#define AXI_DMA_INFIFO_L2_OVF_CH2_INT_CLR_S  7
/** AXI_DMA_INFIFO_L2_UDF_CH2_INT_CLR : WT; bitpos: [8]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L2_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L2_UDF_CH2_INT_CLR    (BIT(8))
#define AXI_DMA_INFIFO_L2_UDF_CH2_INT_CLR_M  (AXI_DMA_INFIFO_L2_UDF_CH2_INT_CLR_V << AXI_DMA_INFIFO_L2_UDF_CH2_INT_CLR_S)
#define AXI_DMA_INFIFO_L2_UDF_CH2_INT_CLR_V  0x00000001U
#define AXI_DMA_INFIFO_L2_UDF_CH2_INT_CLR_S  8
/** AXI_DMA_INFIFO_L3_OVF_CH2_INT_CLR : WT; bitpos: [9]; default: 0;
 *  Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L3_OVF_CH2_INT_CLR    (BIT(9))
#define AXI_DMA_INFIFO_L3_OVF_CH2_INT_CLR_M  (AXI_DMA_INFIFO_L3_OVF_CH2_INT_CLR_V << AXI_DMA_INFIFO_L3_OVF_CH2_INT_CLR_S)
#define AXI_DMA_INFIFO_L3_OVF_CH2_INT_CLR_V  0x00000001U
#define AXI_DMA_INFIFO_L3_OVF_CH2_INT_CLR_S  9
/** AXI_DMA_INFIFO_L3_UDF_CH2_INT_CLR : WT; bitpos: [10]; default: 0;
 *  Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt.
 */
#define AXI_DMA_INFIFO_L3_UDF_CH2_INT_CLR    (BIT(10))
#define AXI_DMA_INFIFO_L3_UDF_CH2_INT_CLR_M  (AXI_DMA_INFIFO_L3_UDF_CH2_INT_CLR_V << AXI_DMA_INFIFO_L3_UDF_CH2_INT_CLR_S)
#define AXI_DMA_INFIFO_L3_UDF_CH2_INT_CLR_V  0x00000001U
#define AXI_DMA_INFIFO_L3_UDF_CH2_INT_CLR_S  10

/** AXI_DMA_IN_CONF0_CH2_REG register
 *  Configure 0 register of Rx channel 2
 */
#define AXI_DMA_IN_CONF0_CH2_REG (DR_REG_AXI_DMA_BASE + 0xe0)
/** AXI_DMA_IN_RST_CH2 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to reset AXI_DMA channel 0 Rx FSM and Rx FIFO pointer.
 */
#define AXI_DMA_IN_RST_CH2    (BIT(0))
#define AXI_DMA_IN_RST_CH2_M  (AXI_DMA_IN_RST_CH2_V << AXI_DMA_IN_RST_CH2_S)
#define AXI_DMA_IN_RST_CH2_V  0x00000001U
#define AXI_DMA_IN_RST_CH2_S  0
/** AXI_DMA_IN_LOOP_TEST_CH2 : R/W; bitpos: [1]; default: 0;
 *  reserved
 */
#define AXI_DMA_IN_LOOP_TEST_CH2    (BIT(1))
#define AXI_DMA_IN_LOOP_TEST_CH2_M  (AXI_DMA_IN_LOOP_TEST_CH2_V << AXI_DMA_IN_LOOP_TEST_CH2_S)
#define AXI_DMA_IN_LOOP_TEST_CH2_V  0x00000001U
#define AXI_DMA_IN_LOOP_TEST_CH2_S  1
/** AXI_DMA_MEM_TRANS_EN_CH2 : R/W; bitpos: [2]; default: 0;
 *  Set this bit 1 to enable automatic transmitting data from memory to memory via
 *  AXI_DMA.
 */
#define AXI_DMA_MEM_TRANS_EN_CH2    (BIT(2))
#define AXI_DMA_MEM_TRANS_EN_CH2_M  (AXI_DMA_MEM_TRANS_EN_CH2_V << AXI_DMA_MEM_TRANS_EN_CH2_S)
#define AXI_DMA_MEM_TRANS_EN_CH2_V  0x00000001U
#define AXI_DMA_MEM_TRANS_EN_CH2_S  2
/** AXI_DMA_IN_ETM_EN_CH2 : R/W; bitpos: [3]; default: 0;
 *  Set this bit to 1 to enable etm control mode, dma Rx channel 0 is triggered by etm
 *  task.
 */
#define AXI_DMA_IN_ETM_EN_CH2    (BIT(3))
#define AXI_DMA_IN_ETM_EN_CH2_M  (AXI_DMA_IN_ETM_EN_CH2_V << AXI_DMA_IN_ETM_EN_CH2_S)
#define AXI_DMA_IN_ETM_EN_CH2_V  0x00000001U
#define AXI_DMA_IN_ETM_EN_CH2_S  3
/** AXI_DMA_IN_BURST_SIZE_SEL_CH2 : R/W; bitpos: [6:4]; default: 0;
 *  3'b000-3'b100:burst length 8byte~128byte
 */
#define AXI_DMA_IN_BURST_SIZE_SEL_CH2    0x00000007U
#define AXI_DMA_IN_BURST_SIZE_SEL_CH2_M  (AXI_DMA_IN_BURST_SIZE_SEL_CH2_V << AXI_DMA_IN_BURST_SIZE_SEL_CH2_S)
#define AXI_DMA_IN_BURST_SIZE_SEL_CH2_V  0x00000007U
#define AXI_DMA_IN_BURST_SIZE_SEL_CH2_S  4
/** AXI_DMA_IN_CMD_DISABLE_CH2 : R/W; bitpos: [7]; default: 0;
 *  1:mean disable cmd of this ch0
 */
#define AXI_DMA_IN_CMD_DISABLE_CH2    (BIT(7))
#define AXI_DMA_IN_CMD_DISABLE_CH2_M  (AXI_DMA_IN_CMD_DISABLE_CH2_V << AXI_DMA_IN_CMD_DISABLE_CH2_S)
#define AXI_DMA_IN_CMD_DISABLE_CH2_V  0x00000001U
#define AXI_DMA_IN_CMD_DISABLE_CH2_S  7
/** AXI_DMA_IN_ECC_AEC_EN_CH2 : R/W; bitpos: [8]; default: 0;
 *  1: mean access ecc or aes domain,0: mean not
 */
#define AXI_DMA_IN_ECC_AEC_EN_CH2    (BIT(8))
#define AXI_DMA_IN_ECC_AEC_EN_CH2_M  (AXI_DMA_IN_ECC_AEC_EN_CH2_V << AXI_DMA_IN_ECC_AEC_EN_CH2_S)
#define AXI_DMA_IN_ECC_AEC_EN_CH2_V  0x00000001U
#define AXI_DMA_IN_ECC_AEC_EN_CH2_S  8
/** AXI_DMA_INDSCR_BURST_EN_CH2 : R/W; bitpos: [9]; default: 0;
 *  Set this bit to 1 to enable INCR burst transfer for Rx channel 0 reading link
 *  descriptor when accessing internal SRAM.
 */
#define AXI_DMA_INDSCR_BURST_EN_CH2    (BIT(9))
#define AXI_DMA_INDSCR_BURST_EN_CH2_M  (AXI_DMA_INDSCR_BURST_EN_CH2_V << AXI_DMA_INDSCR_BURST_EN_CH2_S)
#define AXI_DMA_INDSCR_BURST_EN_CH2_V  0x00000001U
#define AXI_DMA_INDSCR_BURST_EN_CH2_S  9

/** AXI_DMA_IN_CONF1_CH2_REG register
 *  Configure 1 register of Rx channel 2
 */
#define AXI_DMA_IN_CONF1_CH2_REG (DR_REG_AXI_DMA_BASE + 0xe4)
/** AXI_DMA_IN_CHECK_OWNER_CH2 : R/W; bitpos: [12]; default: 0;
 *  Set this bit to enable checking the owner attribute of the link descriptor.
 */
#define AXI_DMA_IN_CHECK_OWNER_CH2    (BIT(12))
#define AXI_DMA_IN_CHECK_OWNER_CH2_M  (AXI_DMA_IN_CHECK_OWNER_CH2_V << AXI_DMA_IN_CHECK_OWNER_CH2_S)
#define AXI_DMA_IN_CHECK_OWNER_CH2_V  0x00000001U
#define AXI_DMA_IN_CHECK_OWNER_CH2_S  12

