espressif/esp-idf/components/soc/esp32s31/register/soc/axi_dma_reg.h
/** AXI_DMA_IN_DSCR_CH2_REG register
 *  Current inlink descriptor address of Rx channel 2
 */
#define AXI_DMA_IN_DSCR_CH2_REG (DR_REG_AXI_DMA_BASE + 0x104)
/** AXI_DMA_INLINK_DSCR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  The address of the current inlink descriptor x.
 */
#define AXI_DMA_INLINK_DSCR_CH2    0xFFFFFFFFU
#define AXI_DMA_INLINK_DSCR_CH2_M  (AXI_DMA_INLINK_DSCR_CH2_V << AXI_DMA_INLINK_DSCR_CH2_S)
#define AXI_DMA_INLINK_DSCR_CH2_V  0xFFFFFFFFU
#define AXI_DMA_INLINK_DSCR_CH2_S  0

/** AXI_DMA_IN_DSCR_BF0_CH2_REG register
 *  The last inlink descriptor address of Rx channel 2
 */
#define AXI_DMA_IN_DSCR_BF0_CH2_REG (DR_REG_AXI_DMA_BASE + 0x108)
/** AXI_DMA_INLINK_DSCR_BF0_CH2 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last inlink descriptor x-1.
 */
#define AXI_DMA_INLINK_DSCR_BF0_CH2    0xFFFFFFFFU
#define AXI_DMA_INLINK_DSCR_BF0_CH2_M  (AXI_DMA_INLINK_DSCR_BF0_CH2_V << AXI_DMA_INLINK_DSCR_BF0_CH2_S)
#define AXI_DMA_INLINK_DSCR_BF0_CH2_V  0xFFFFFFFFU
#define AXI_DMA_INLINK_DSCR_BF0_CH2_S  0

/** AXI_DMA_IN_DSCR_BF1_CH2_REG register
 *  The second-to-last inlink descriptor address of Rx channel 2
 */
#define AXI_DMA_IN_DSCR_BF1_CH2_REG (DR_REG_AXI_DMA_BASE + 0x10c)
/** AXI_DMA_INLINK_DSCR_BF1_CH2 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last inlink descriptor x-2.
 */
#define AXI_DMA_INLINK_DSCR_BF1_CH2    0xFFFFFFFFU
#define AXI_DMA_INLINK_DSCR_BF1_CH2_M  (AXI_DMA_INLINK_DSCR_BF1_CH2_V << AXI_DMA_INLINK_DSCR_BF1_CH2_S)
#define AXI_DMA_INLINK_DSCR_BF1_CH2_V  0xFFFFFFFFU
#define AXI_DMA_INLINK_DSCR_BF1_CH2_S  0

/** AXI_DMA_IN_PRI_CH2_REG register
 *  Priority register of Rx channel 2
 */
#define AXI_DMA_IN_PRI_CH2_REG (DR_REG_AXI_DMA_BASE + 0x110)
/** AXI_DMA_RX_PRI_CH2 : R/W; bitpos: [3:0]; default: 0;
 *  The priority of Rx channel 0. The larger of the value the higher of the priority.
 */
#define AXI_DMA_RX_PRI_CH2    0x0000000FU
#define AXI_DMA_RX_PRI_CH2_M  (AXI_DMA_RX_PRI_CH2_V << AXI_DMA_RX_PRI_CH2_S)
#define AXI_DMA_RX_PRI_CH2_V  0x0000000FU
#define AXI_DMA_RX_PRI_CH2_S  0
/** AXI_DMA_RX_CH_ARB_WEIGH_CH2 : R/W; bitpos: [7:4]; default: 0;
 *  The weight of Rx channel 0
 */
#define AXI_DMA_RX_CH_ARB_WEIGH_CH2    0x0000000FU
#define AXI_DMA_RX_CH_ARB_WEIGH_CH2_M  (AXI_DMA_RX_CH_ARB_WEIGH_CH2_V << AXI_DMA_RX_CH_ARB_WEIGH_CH2_S)
#define AXI_DMA_RX_CH_ARB_WEIGH_CH2_V  0x0000000FU
#define AXI_DMA_RX_CH_ARB_WEIGH_CH2_S  4
/** AXI_DMA_RX_ARB_WEIGH_OPT_DIR_CH2 : R/W; bitpos: [8]; default: 0;
 *  0: mean not optimization weight function ,1: mean optimization
 */
#define AXI_DMA_RX_ARB_WEIGH_OPT_DIR_CH2    (BIT(8))
#define AXI_DMA_RX_ARB_WEIGH_OPT_DIR_CH2_M  (AXI_DMA_RX_ARB_WEIGH_OPT_DIR_CH2_V << AXI_DMA_RX_ARB_WEIGH_OPT_DIR_CH2_S)
#define AXI_DMA_RX_ARB_WEIGH_OPT_DIR_CH2_V  0x00000001U
#define AXI_DMA_RX_ARB_WEIGH_OPT_DIR_CH2_S  8

/** AXI_DMA_IN_PERI_SEL_CH2_REG register
 *  Peripheral selection of Rx channel 2
 */
#define AXI_DMA_IN_PERI_SEL_CH2_REG (DR_REG_AXI_DMA_BASE + 0x114)
/** AXI_DMA_PERI_IN_SEL_CH2 : R/W; bitpos: [5:0]; default: 63;
 *  This register is used to select peripheral for Rx channel 0. 0:lcdcam. 1: gpspi_2.
 *  2: gpspi_3. 3: parl_io. 4: aes. 5: sha. 6~15: Dummy
 */
#define AXI_DMA_PERI_IN_SEL_CH2    0x0000003FU
#define AXI_DMA_PERI_IN_SEL_CH2_M  (AXI_DMA_PERI_IN_SEL_CH2_V << AXI_DMA_PERI_IN_SEL_CH2_S)
#define AXI_DMA_PERI_IN_SEL_CH2_V  0x0000003FU
#define AXI_DMA_PERI_IN_SEL_CH2_S  0

/** AXI_DMA_OUT_INT_RAW_CH0_REG register
 *  Raw status interrupt of channel0
 */
#define AXI_DMA_OUT_INT_RAW_CH0_REG (DR_REG_AXI_DMA_BASE + 0x138)
/** AXI_DMA_OUT_DONE_CH0_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one outlink
 *  descriptor has been transmitted to peripherals for Tx channel0.
 */
#define AXI_DMA_OUT_DONE_CH0_INT_RAW    (BIT(0))
#define AXI_DMA_OUT_DONE_CH0_INT_RAW_M  (AXI_DMA_OUT_DONE_CH0_INT_RAW_V << AXI_DMA_OUT_DONE_CH0_INT_RAW_S)
#define AXI_DMA_OUT_DONE_CH0_INT_RAW_V  0x00000001U
#define AXI_DMA_OUT_DONE_CH0_INT_RAW_S  0
/** AXI_DMA_OUT_EOF_CH0_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one outlink
 *  descriptor has been read from memory for Tx channel0.
 */
#define AXI_DMA_OUT_EOF_CH0_INT_RAW    (BIT(1))
#define AXI_DMA_OUT_EOF_CH0_INT_RAW_M  (AXI_DMA_OUT_EOF_CH0_INT_RAW_V << AXI_DMA_OUT_EOF_CH0_INT_RAW_S)
#define AXI_DMA_OUT_EOF_CH0_INT_RAW_V  0x00000001U
#define AXI_DMA_OUT_EOF_CH0_INT_RAW_S  1
/** AXI_DMA_OUT_DSCR_ERR_CH0_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt bit turns to high level when detecting outlink descriptor error
 *  including owner error and the second and third word error of outlink descriptor for
 *  Tx channel0.
 */
#define AXI_DMA_OUT_DSCR_ERR_CH0_INT_RAW    (BIT(2))
#define AXI_DMA_OUT_DSCR_ERR_CH0_INT_RAW_M  (AXI_DMA_OUT_DSCR_ERR_CH0_INT_RAW_V << AXI_DMA_OUT_DSCR_ERR_CH0_INT_RAW_S)
#define AXI_DMA_OUT_DSCR_ERR_CH0_INT_RAW_V  0x00000001U
#define AXI_DMA_OUT_DSCR_ERR_CH0_INT_RAW_S  2
/** AXI_DMA_OUT_TOTAL_EOF_CH0_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt bit turns to high level when data corresponding a outlink
 *  (includes one link descriptor or few link descriptors) is transmitted out for Tx
 *  channel0.
 */
#define AXI_DMA_OUT_TOTAL_EOF_CH0_INT_RAW    (BIT(3))
#define AXI_DMA_OUT_TOTAL_EOF_CH0_INT_RAW_M  (AXI_DMA_OUT_TOTAL_EOF_CH0_INT_RAW_V << AXI_DMA_OUT_TOTAL_EOF_CH0_INT_RAW_S)
#define AXI_DMA_OUT_TOTAL_EOF_CH0_INT_RAW_V  0x00000001U
#define AXI_DMA_OUT_TOTAL_EOF_CH0_INT_RAW_S  3
/** AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Tx channel0 is
 *  overflow.
 */
#define AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_RAW    (BIT(4))
#define AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_RAW_M  (AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_RAW_V << AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_RAW_S)
#define AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_RAW_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_RAW_S  4
/** AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Tx channel0 is
 *  underflow.
 */
#define AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_RAW    (BIT(5))
#define AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_RAW_M  (AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_RAW_V << AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_RAW_S)
#define AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_RAW_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_RAW_S  5
/** AXI_DMA_OUTFIFO_L2_OVF_CH0_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Tx channel0 is
 *  overflow.
 */
#define AXI_DMA_OUTFIFO_L2_OVF_CH0_INT_RAW    (BIT(6))
#define AXI_DMA_OUTFIFO_L2_OVF_CH0_INT_RAW_M  (AXI_DMA_OUTFIFO_L2_OVF_CH0_INT_RAW_V << AXI_DMA_OUTFIFO_L2_OVF_CH0_INT_RAW_S)
#define AXI_DMA_OUTFIFO_L2_OVF_CH0_INT_RAW_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_OVF_CH0_INT_RAW_S  6
/** AXI_DMA_OUTFIFO_L2_UDF_CH0_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Tx channel0 is
 *  underflow.
 */
#define AXI_DMA_OUTFIFO_L2_UDF_CH0_INT_RAW    (BIT(7))
#define AXI_DMA_OUTFIFO_L2_UDF_CH0_INT_RAW_M  (AXI_DMA_OUTFIFO_L2_UDF_CH0_INT_RAW_V << AXI_DMA_OUTFIFO_L2_UDF_CH0_INT_RAW_S)
#define AXI_DMA_OUTFIFO_L2_UDF_CH0_INT_RAW_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_UDF_CH0_INT_RAW_S  7
/** AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Tx channel0 is
 *  overflow.
 */
#define AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_RAW    (BIT(8))
#define AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_RAW_M  (AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_RAW_V << AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_RAW_S)
#define AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_RAW_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_RAW_S  8
/** AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Tx channel0 is
 *  underflow.
 */
#define AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_RAW    (BIT(9))
#define AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_RAW_M  (AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_RAW_V << AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_RAW_S)
#define AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_RAW_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_RAW_S  9
/** AXI_DMA_OUT_LINK_SWITCH_CH0_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  The raw interrupt bit turns to high level when the dma switch to new link for Tx
 *  channel0.
 */
#define AXI_DMA_OUT_LINK_SWITCH_CH0_INT_RAW    (BIT(10))
#define AXI_DMA_OUT_LINK_SWITCH_CH0_INT_RAW_M  (AXI_DMA_OUT_LINK_SWITCH_CH0_INT_RAW_V << AXI_DMA_OUT_LINK_SWITCH_CH0_INT_RAW_S)
#define AXI_DMA_OUT_LINK_SWITCH_CH0_INT_RAW_V  0x00000001U
#define AXI_DMA_OUT_LINK_SWITCH_CH0_INT_RAW_S  10

/** AXI_DMA_OUT_INT_ST_CH0_REG register
 *  Masked interrupt of channel0
 */
#define AXI_DMA_OUT_INT_ST_CH0_REG (DR_REG_AXI_DMA_BASE + 0x13c)
/** AXI_DMA_OUT_DONE_CH0_INT_ST : RO; bitpos: [0]; default: 0;
 *  The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.
 */
#define AXI_DMA_OUT_DONE_CH0_INT_ST    (BIT(0))
#define AXI_DMA_OUT_DONE_CH0_INT_ST_M  (AXI_DMA_OUT_DONE_CH0_INT_ST_V << AXI_DMA_OUT_DONE_CH0_INT_ST_S)
#define AXI_DMA_OUT_DONE_CH0_INT_ST_V  0x00000001U
#define AXI_DMA_OUT_DONE_CH0_INT_ST_S  0
/** AXI_DMA_OUT_EOF_CH0_INT_ST : RO; bitpos: [1]; default: 0;
 *  The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.
 */
#define AXI_DMA_OUT_EOF_CH0_INT_ST    (BIT(1))
#define AXI_DMA_OUT_EOF_CH0_INT_ST_M  (AXI_DMA_OUT_EOF_CH0_INT_ST_V << AXI_DMA_OUT_EOF_CH0_INT_ST_S)
#define AXI_DMA_OUT_EOF_CH0_INT_ST_V  0x00000001U
#define AXI_DMA_OUT_EOF_CH0_INT_ST_S  1
/** AXI_DMA_OUT_DSCR_ERR_CH0_INT_ST : RO; bitpos: [2]; default: 0;
 *  The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define AXI_DMA_OUT_DSCR_ERR_CH0_INT_ST    (BIT(2))
#define AXI_DMA_OUT_DSCR_ERR_CH0_INT_ST_M  (AXI_DMA_OUT_DSCR_ERR_CH0_INT_ST_V << AXI_DMA_OUT_DSCR_ERR_CH0_INT_ST_S)
#define AXI_DMA_OUT_DSCR_ERR_CH0_INT_ST_V  0x00000001U
#define AXI_DMA_OUT_DSCR_ERR_CH0_INT_ST_S  2
/** AXI_DMA_OUT_TOTAL_EOF_CH0_INT_ST : RO; bitpos: [3]; default: 0;
 *  The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define AXI_DMA_OUT_TOTAL_EOF_CH0_INT_ST    (BIT(3))
#define AXI_DMA_OUT_TOTAL_EOF_CH0_INT_ST_M  (AXI_DMA_OUT_TOTAL_EOF_CH0_INT_ST_V << AXI_DMA_OUT_TOTAL_EOF_CH0_INT_ST_S)
#define AXI_DMA_OUT_TOTAL_EOF_CH0_INT_ST_V  0x00000001U
#define AXI_DMA_OUT_TOTAL_EOF_CH0_INT_ST_S  3
/** AXI_DMA_OUTFIFO_OVF_CH0_INT_ST : RO; bitpos: [4]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_OVF_CH0_INT_ST    (BIT(4))
#define AXI_DMA_OUTFIFO_OVF_CH0_INT_ST_M  (AXI_DMA_OUTFIFO_OVF_CH0_INT_ST_V << AXI_DMA_OUTFIFO_OVF_CH0_INT_ST_S)
#define AXI_DMA_OUTFIFO_OVF_CH0_INT_ST_V  0x00000001U
#define AXI_DMA_OUTFIFO_OVF_CH0_INT_ST_S  4
/** AXI_DMA_OUTFIFO_UDF_CH0_INT_ST : RO; bitpos: [5]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_UDF_CH0_INT_ST    (BIT(5))
#define AXI_DMA_OUTFIFO_UDF_CH0_INT_ST_M  (AXI_DMA_OUTFIFO_UDF_CH0_INT_ST_V << AXI_DMA_OUTFIFO_UDF_CH0_INT_ST_S)
#define AXI_DMA_OUTFIFO_UDF_CH0_INT_ST_V  0x00000001U
#define AXI_DMA_OUTFIFO_UDF_CH0_INT_ST_S  5
/** AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_ST : RO; bitpos: [6]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_ST    (BIT(6))
#define AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_ST_M  (AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_ST_V << AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_ST_S)
#define AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_ST_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_ST_S  6
/** AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_ST : RO; bitpos: [7]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_ST    (BIT(7))
#define AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_ST_M  (AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_ST_V << AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_ST_S)
#define AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_ST_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_ST_S  7
/** AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_ST : RO; bitpos: [8]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_ST    (BIT(8))
#define AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_ST_M  (AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_ST_V << AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_ST_S)
#define AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_ST_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_ST_S  8
/** AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_ST : RO; bitpos: [9]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_ST    (BIT(9))
#define AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_ST_M  (AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_ST_V << AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_ST_S)
#define AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_ST_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_ST_S  9
/** AXI_DMA_OUT_LINK_SWITCH_CH0_INT_ST : RO; bitpos: [10]; default: 0;
 *  The raw interrupt status bit for the OUT_LINK_SWITCH_CH_INT interrupt.
 */
#define AXI_DMA_OUT_LINK_SWITCH_CH0_INT_ST    (BIT(10))
#define AXI_DMA_OUT_LINK_SWITCH_CH0_INT_ST_M  (AXI_DMA_OUT_LINK_SWITCH_CH0_INT_ST_V << AXI_DMA_OUT_LINK_SWITCH_CH0_INT_ST_S)
#define AXI_DMA_OUT_LINK_SWITCH_CH0_INT_ST_V  0x00000001U
#define AXI_DMA_OUT_LINK_SWITCH_CH0_INT_ST_S  10

/** AXI_DMA_OUT_INT_ENA_CH0_REG register
 *  Interrupt enable bits of channel0
 */
#define AXI_DMA_OUT_INT_ENA_CH0_REG (DR_REG_AXI_DMA_BASE + 0x140)
/** AXI_DMA_OUT_DONE_CH0_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The interrupt enable bit for the OUT_DONE_CH_INT interrupt.
 */
#define AXI_DMA_OUT_DONE_CH0_INT_ENA    (BIT(0))
#define AXI_DMA_OUT_DONE_CH0_INT_ENA_M  (AXI_DMA_OUT_DONE_CH0_INT_ENA_V << AXI_DMA_OUT_DONE_CH0_INT_ENA_S)
#define AXI_DMA_OUT_DONE_CH0_INT_ENA_V  0x00000001U
#define AXI_DMA_OUT_DONE_CH0_INT_ENA_S  0
/** AXI_DMA_OUT_EOF_CH0_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The interrupt enable bit for the OUT_EOF_CH_INT interrupt.
 */
#define AXI_DMA_OUT_EOF_CH0_INT_ENA    (BIT(1))
#define AXI_DMA_OUT_EOF_CH0_INT_ENA_M  (AXI_DMA_OUT_EOF_CH0_INT_ENA_V << AXI_DMA_OUT_EOF_CH0_INT_ENA_S)
#define AXI_DMA_OUT_EOF_CH0_INT_ENA_V  0x00000001U
#define AXI_DMA_OUT_EOF_CH0_INT_ENA_S  1
/** AXI_DMA_OUT_DSCR_ERR_CH0_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define AXI_DMA_OUT_DSCR_ERR_CH0_INT_ENA    (BIT(2))
#define AXI_DMA_OUT_DSCR_ERR_CH0_INT_ENA_M  (AXI_DMA_OUT_DSCR_ERR_CH0_INT_ENA_V << AXI_DMA_OUT_DSCR_ERR_CH0_INT_ENA_S)
#define AXI_DMA_OUT_DSCR_ERR_CH0_INT_ENA_V  0x00000001U
#define AXI_DMA_OUT_DSCR_ERR_CH0_INT_ENA_S  2
/** AXI_DMA_OUT_TOTAL_EOF_CH0_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define AXI_DMA_OUT_TOTAL_EOF_CH0_INT_ENA    (BIT(3))
#define AXI_DMA_OUT_TOTAL_EOF_CH0_INT_ENA_M  (AXI_DMA_OUT_TOTAL_EOF_CH0_INT_ENA_V << AXI_DMA_OUT_TOTAL_EOF_CH0_INT_ENA_S)
#define AXI_DMA_OUT_TOTAL_EOF_CH0_INT_ENA_V  0x00000001U
#define AXI_DMA_OUT_TOTAL_EOF_CH0_INT_ENA_S  3
/** AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_ENA    (BIT(4))
#define AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_ENA_M  (AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_ENA_V << AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_ENA_S)
#define AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_ENA_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_ENA_S  4
/** AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_ENA    (BIT(5))
#define AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_ENA_M  (AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_ENA_V << AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_ENA_S)
#define AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_ENA_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_ENA_S  5
/** AXI_DMA_OUTFIFO_L2_OVF_CH0_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L2_OVF_CH0_INT_ENA    (BIT(6))
#define AXI_DMA_OUTFIFO_L2_OVF_CH0_INT_ENA_M  (AXI_DMA_OUTFIFO_L2_OVF_CH0_INT_ENA_V << AXI_DMA_OUTFIFO_L2_OVF_CH0_INT_ENA_S)
#define AXI_DMA_OUTFIFO_L2_OVF_CH0_INT_ENA_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_OVF_CH0_INT_ENA_S  6
/** AXI_DMA_OUTFIFO_L2_UDF_CH0_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L2_UDF_CH0_INT_ENA    (BIT(7))
#define AXI_DMA_OUTFIFO_L2_UDF_CH0_INT_ENA_M  (AXI_DMA_OUTFIFO_L2_UDF_CH0_INT_ENA_V << AXI_DMA_OUTFIFO_L2_UDF_CH0_INT_ENA_S)
#define AXI_DMA_OUTFIFO_L2_UDF_CH0_INT_ENA_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_UDF_CH0_INT_ENA_S  7
/** AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_OVF_L3_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_ENA    (BIT(8))
#define AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_ENA_M  (AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_ENA_V << AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_ENA_S)
#define AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_ENA_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_ENA_S  8
/** AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_UDF_L3_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_ENA    (BIT(9))
#define AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_ENA_M  (AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_ENA_V << AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_ENA_S)
#define AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_ENA_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_ENA_S  9
/** AXI_DMA_OUT_LINK_SWITCH_CH0_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  The interrupt enable bit for the OUT_LINK_SWITCH_CH_INT interrupt.
 */
#define AXI_DMA_OUT_LINK_SWITCH_CH0_INT_ENA    (BIT(10))
#define AXI_DMA_OUT_LINK_SWITCH_CH0_INT_ENA_M  (AXI_DMA_OUT_LINK_SWITCH_CH0_INT_ENA_V << AXI_DMA_OUT_LINK_SWITCH_CH0_INT_ENA_S)
#define AXI_DMA_OUT_LINK_SWITCH_CH0_INT_ENA_V  0x00000001U
#define AXI_DMA_OUT_LINK_SWITCH_CH0_INT_ENA_S  10

/** AXI_DMA_OUT_INT_CLR_CH0_REG register
 *  Interrupt clear bits of channel0
 */
#define AXI_DMA_OUT_INT_CLR_CH0_REG (DR_REG_AXI_DMA_BASE + 0x144)
/** AXI_DMA_OUT_DONE_CH0_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear the OUT_DONE_CH_INT interrupt.
 */
#define AXI_DMA_OUT_DONE_CH0_INT_CLR    (BIT(0))
#define AXI_DMA_OUT_DONE_CH0_INT_CLR_M  (AXI_DMA_OUT_DONE_CH0_INT_CLR_V << AXI_DMA_OUT_DONE_CH0_INT_CLR_S)
#define AXI_DMA_OUT_DONE_CH0_INT_CLR_V  0x00000001U
#define AXI_DMA_OUT_DONE_CH0_INT_CLR_S  0
/** AXI_DMA_OUT_EOF_CH0_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear the OUT_EOF_CH_INT interrupt.
 */
#define AXI_DMA_OUT_EOF_CH0_INT_CLR    (BIT(1))
#define AXI_DMA_OUT_EOF_CH0_INT_CLR_M  (AXI_DMA_OUT_EOF_CH0_INT_CLR_V << AXI_DMA_OUT_EOF_CH0_INT_CLR_S)
#define AXI_DMA_OUT_EOF_CH0_INT_CLR_V  0x00000001U
#define AXI_DMA_OUT_EOF_CH0_INT_CLR_S  1
/** AXI_DMA_OUT_DSCR_ERR_CH0_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define AXI_DMA_OUT_DSCR_ERR_CH0_INT_CLR    (BIT(2))
#define AXI_DMA_OUT_DSCR_ERR_CH0_INT_CLR_M  (AXI_DMA_OUT_DSCR_ERR_CH0_INT_CLR_V << AXI_DMA_OUT_DSCR_ERR_CH0_INT_CLR_S)
#define AXI_DMA_OUT_DSCR_ERR_CH0_INT_CLR_V  0x00000001U
#define AXI_DMA_OUT_DSCR_ERR_CH0_INT_CLR_S  2
/** AXI_DMA_OUT_TOTAL_EOF_CH0_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define AXI_DMA_OUT_TOTAL_EOF_CH0_INT_CLR    (BIT(3))
#define AXI_DMA_OUT_TOTAL_EOF_CH0_INT_CLR_M  (AXI_DMA_OUT_TOTAL_EOF_CH0_INT_CLR_V << AXI_DMA_OUT_TOTAL_EOF_CH0_INT_CLR_S)
#define AXI_DMA_OUT_TOTAL_EOF_CH0_INT_CLR_V  0x00000001U
#define AXI_DMA_OUT_TOTAL_EOF_CH0_INT_CLR_S  3
/** AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_CLR    (BIT(4))
#define AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_CLR_M  (AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_CLR_V << AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_CLR_S)
#define AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_CLR_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_OVF_CH0_INT_CLR_S  4
/** AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_CLR    (BIT(5))
#define AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_CLR_M  (AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_CLR_V << AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_CLR_S)
#define AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_CLR_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_UDF_CH0_INT_CLR_S  5
/** AXI_DMA_OUTFIFO_L2_OVF_CH0_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Set this bit to clear the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L2_OVF_CH0_INT_CLR    (BIT(6))
#define AXI_DMA_OUTFIFO_L2_OVF_CH0_INT_CLR_M  (AXI_DMA_OUTFIFO_L2_OVF_CH0_INT_CLR_V << AXI_DMA_OUTFIFO_L2_OVF_CH0_INT_CLR_S)
#define AXI_DMA_OUTFIFO_L2_OVF_CH0_INT_CLR_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_OVF_CH0_INT_CLR_S  6
/** AXI_DMA_OUTFIFO_L2_UDF_CH0_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Set this bit to clear the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L2_UDF_CH0_INT_CLR    (BIT(7))
#define AXI_DMA_OUTFIFO_L2_UDF_CH0_INT_CLR_M  (AXI_DMA_OUTFIFO_L2_UDF_CH0_INT_CLR_V << AXI_DMA_OUTFIFO_L2_UDF_CH0_INT_CLR_S)
#define AXI_DMA_OUTFIFO_L2_UDF_CH0_INT_CLR_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_UDF_CH0_INT_CLR_S  7
/** AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_CLR : WT; bitpos: [8]; default: 0;
 *  Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_CLR    (BIT(8))
#define AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_CLR_M  (AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_CLR_V << AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_CLR_S)
#define AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_CLR_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_OVF_CH0_INT_CLR_S  8
/** AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_CLR : WT; bitpos: [9]; default: 0;
 *  Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_CLR    (BIT(9))
#define AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_CLR_M  (AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_CLR_V << AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_CLR_S)
#define AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_CLR_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_UDF_CH0_INT_CLR_S  9
/** AXI_DMA_OUT_LINK_SWITCH_CH0_INT_CLR : WT; bitpos: [10]; default: 0;
 *  Set this bit to clear the OUT_LINK_SWITCH_CH_INT interrupt.
 */
#define AXI_DMA_OUT_LINK_SWITCH_CH0_INT_CLR    (BIT(10))
#define AXI_DMA_OUT_LINK_SWITCH_CH0_INT_CLR_M  (AXI_DMA_OUT_LINK_SWITCH_CH0_INT_CLR_V << AXI_DMA_OUT_LINK_SWITCH_CH0_INT_CLR_S)
#define AXI_DMA_OUT_LINK_SWITCH_CH0_INT_CLR_V  0x00000001U
#define AXI_DMA_OUT_LINK_SWITCH_CH0_INT_CLR_S  10

