espressif/esp-idf/components/soc/esp32s31/register/soc/axi_dma_reg.h
/** AXI_DMA_OUT_LINK2_CH0_REG register
 *  Link descriptor configure and control register of Tx channel0
 */
#define AXI_DMA_OUT_LINK2_CH0_REG (DR_REG_AXI_DMA_BASE + 0x15c)
/** AXI_DMA_OUTLINK_ADDR_CH0 : R/W; bitpos: [31:0]; default: 0;
 *  This register stores the 32 least significant bits of the first outlink
 *  descriptor's address.
 */
#define AXI_DMA_OUTLINK_ADDR_CH0    0xFFFFFFFFU
#define AXI_DMA_OUTLINK_ADDR_CH0_M  (AXI_DMA_OUTLINK_ADDR_CH0_V << AXI_DMA_OUTLINK_ADDR_CH0_S)
#define AXI_DMA_OUTLINK_ADDR_CH0_V  0xFFFFFFFFU
#define AXI_DMA_OUTLINK_ADDR_CH0_S  0

/** AXI_DMA_OUT_STATE_CH0_REG register
 *  Transmit status of Tx channel0
 */
#define AXI_DMA_OUT_STATE_CH0_REG (DR_REG_AXI_DMA_BASE + 0x160)
/** AXI_DMA_OUTLINK_DSCR_ADDR_CH0 : RO; bitpos: [17:0]; default: 0;
 *  This register stores the current outlink descriptor's address.
 */
#define AXI_DMA_OUTLINK_DSCR_ADDR_CH0    0x0003FFFFU
#define AXI_DMA_OUTLINK_DSCR_ADDR_CH0_M  (AXI_DMA_OUTLINK_DSCR_ADDR_CH0_V << AXI_DMA_OUTLINK_DSCR_ADDR_CH0_S)
#define AXI_DMA_OUTLINK_DSCR_ADDR_CH0_V  0x0003FFFFU
#define AXI_DMA_OUTLINK_DSCR_ADDR_CH0_S  0
/** AXI_DMA_OUT_DSCR_STATE_CH0 : RO; bitpos: [19:18]; default: 0;
 *  reserved
 */
#define AXI_DMA_OUT_DSCR_STATE_CH0    0x00000003U
#define AXI_DMA_OUT_DSCR_STATE_CH0_M  (AXI_DMA_OUT_DSCR_STATE_CH0_V << AXI_DMA_OUT_DSCR_STATE_CH0_S)
#define AXI_DMA_OUT_DSCR_STATE_CH0_V  0x00000003U
#define AXI_DMA_OUT_DSCR_STATE_CH0_S  18
/** AXI_DMA_OUT_STATE_CH0 : RO; bitpos: [22:20]; default: 0;
 *  reserved
 */
#define AXI_DMA_OUT_STATE_CH0    0x00000007U
#define AXI_DMA_OUT_STATE_CH0_M  (AXI_DMA_OUT_STATE_CH0_V << AXI_DMA_OUT_STATE_CH0_S)
#define AXI_DMA_OUT_STATE_CH0_V  0x00000007U
#define AXI_DMA_OUT_STATE_CH0_S  20

/** AXI_DMA_OUT_EOF_DES_ADDR_CH0_REG register
 *  Outlink descriptor address when EOF occurs of Tx channel0
 */
#define AXI_DMA_OUT_EOF_DES_ADDR_CH0_REG (DR_REG_AXI_DMA_BASE + 0x164)
/** AXI_DMA_OUT_EOF_DES_ADDR_CH0 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the outlink descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define AXI_DMA_OUT_EOF_DES_ADDR_CH0    0xFFFFFFFFU
#define AXI_DMA_OUT_EOF_DES_ADDR_CH0_M  (AXI_DMA_OUT_EOF_DES_ADDR_CH0_V << AXI_DMA_OUT_EOF_DES_ADDR_CH0_S)
#define AXI_DMA_OUT_EOF_DES_ADDR_CH0_V  0xFFFFFFFFU
#define AXI_DMA_OUT_EOF_DES_ADDR_CH0_S  0

/** AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH0_REG register
 *  The last outlink descriptor address when EOF occurs of Tx channel0
 */
#define AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH0_REG (DR_REG_AXI_DMA_BASE + 0x168)
/** AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH0 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the outlink descriptor before the last outlink
 *  descriptor.
 */
#define AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH0    0xFFFFFFFFU
#define AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH0_M  (AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH0_V << AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH0_S)
#define AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH0_V  0xFFFFFFFFU
#define AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH0_S  0

/** AXI_DMA_OUT_DSCR_CH0_REG register
 *  Current outlink descriptor address of Tx channel0
 */
#define AXI_DMA_OUT_DSCR_CH0_REG (DR_REG_AXI_DMA_BASE + 0x16c)
/** AXI_DMA_OUTLINK_DSCR_CH0 : RO; bitpos: [31:0]; default: 0;
 *  The address of the current outlink descriptor y.
 */
#define AXI_DMA_OUTLINK_DSCR_CH0    0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_CH0_M  (AXI_DMA_OUTLINK_DSCR_CH0_V << AXI_DMA_OUTLINK_DSCR_CH0_S)
#define AXI_DMA_OUTLINK_DSCR_CH0_V  0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_CH0_S  0

/** AXI_DMA_OUT_DSCR_BF0_CH0_REG register
 *  The last outlink descriptor address of Tx channel0
 */
#define AXI_DMA_OUT_DSCR_BF0_CH0_REG (DR_REG_AXI_DMA_BASE + 0x170)
/** AXI_DMA_OUTLINK_DSCR_BF0_CH0 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last outlink descriptor y-1.
 */
#define AXI_DMA_OUTLINK_DSCR_BF0_CH0    0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_BF0_CH0_M  (AXI_DMA_OUTLINK_DSCR_BF0_CH0_V << AXI_DMA_OUTLINK_DSCR_BF0_CH0_S)
#define AXI_DMA_OUTLINK_DSCR_BF0_CH0_V  0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_BF0_CH0_S  0

/** AXI_DMA_OUT_DSCR_BF1_CH0_REG register
 *  The second-to-last outlink descriptor address of Tx channel0
 */
#define AXI_DMA_OUT_DSCR_BF1_CH0_REG (DR_REG_AXI_DMA_BASE + 0x174)
/** AXI_DMA_OUTLINK_DSCR_BF1_CH0 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last outlink descriptor x-2.
 */
#define AXI_DMA_OUTLINK_DSCR_BF1_CH0    0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_BF1_CH0_M  (AXI_DMA_OUTLINK_DSCR_BF1_CH0_V << AXI_DMA_OUTLINK_DSCR_BF1_CH0_S)
#define AXI_DMA_OUTLINK_DSCR_BF1_CH0_V  0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_BF1_CH0_S  0

/** AXI_DMA_OUT_PRI_CH0_REG register
 *  Priority register of Tx channel0.
 */
#define AXI_DMA_OUT_PRI_CH0_REG (DR_REG_AXI_DMA_BASE + 0x178)
/** AXI_DMA_TX_PRI_CH0 : R/W; bitpos: [3:0]; default: 0;
 *  The priority of Tx channel0. The larger of the value the higher of the priority.
 */
#define AXI_DMA_TX_PRI_CH0    0x0000000FU
#define AXI_DMA_TX_PRI_CH0_M  (AXI_DMA_TX_PRI_CH0_V << AXI_DMA_TX_PRI_CH0_S)
#define AXI_DMA_TX_PRI_CH0_V  0x0000000FU
#define AXI_DMA_TX_PRI_CH0_S  0
/** AXI_DMA_TX_CH_ARB_WEIGH_CH0 : R/W; bitpos: [7:4]; default: 0;
 *  The weight of Tx channel0
 */
#define AXI_DMA_TX_CH_ARB_WEIGH_CH0    0x0000000FU
#define AXI_DMA_TX_CH_ARB_WEIGH_CH0_M  (AXI_DMA_TX_CH_ARB_WEIGH_CH0_V << AXI_DMA_TX_CH_ARB_WEIGH_CH0_S)
#define AXI_DMA_TX_CH_ARB_WEIGH_CH0_V  0x0000000FU
#define AXI_DMA_TX_CH_ARB_WEIGH_CH0_S  4
/** AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH0 : R/W; bitpos: [8]; default: 0;
 *  0: mean not optimization weight function ,1: mean optimization
 */
#define AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH0    (BIT(8))
#define AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH0_M  (AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH0_V << AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH0_S)
#define AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH0_V  0x00000001U
#define AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH0_S  8

/** AXI_DMA_OUT_PERI_SEL_CH0_REG register
 *  Peripheral selection of Tx channel0
 */
#define AXI_DMA_OUT_PERI_SEL_CH0_REG (DR_REG_AXI_DMA_BASE + 0x17c)
/** AXI_DMA_PERI_OUT_SEL_CH0 : R/W; bitpos: [5:0]; default: 63;
 *  This register is used to select peripheral for Tx channel0. 0:lcdcam. 1: gpspi_2.
 *  2: gpspi_3. 3: parl_io. 4: aes. 5: sha. 6~15: Dummy
 */
#define AXI_DMA_PERI_OUT_SEL_CH0    0x0000003FU
#define AXI_DMA_PERI_OUT_SEL_CH0_M  (AXI_DMA_PERI_OUT_SEL_CH0_V << AXI_DMA_PERI_OUT_SEL_CH0_S)
#define AXI_DMA_PERI_OUT_SEL_CH0_V  0x0000003FU
#define AXI_DMA_PERI_OUT_SEL_CH0_S  0

