espressif/esp-idf/components/soc/esp32s31/register/soc/axi_dma_reg.h
/** AXI_DMA_OUT_PUSH_CH1_REG register
 *  Push control register of Tx channel1
 */
#define AXI_DMA_OUT_PUSH_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1bc)
/** AXI_DMA_OUTFIFO_WDATA_CH1 : R/W; bitpos: [8:0]; default: 0;
 *  This register stores the data that need to be pushed into AXI_DMA FIFO.
 */
#define AXI_DMA_OUTFIFO_WDATA_CH1    0x000001FFU
#define AXI_DMA_OUTFIFO_WDATA_CH1_M  (AXI_DMA_OUTFIFO_WDATA_CH1_V << AXI_DMA_OUTFIFO_WDATA_CH1_S)
#define AXI_DMA_OUTFIFO_WDATA_CH1_V  0x000001FFU
#define AXI_DMA_OUTFIFO_WDATA_CH1_S  0
/** AXI_DMA_OUTFIFO_PUSH_CH1 : WT; bitpos: [9]; default: 0;
 *  Set this bit to push data into AXI_DMA FIFO.
 */
#define AXI_DMA_OUTFIFO_PUSH_CH1    (BIT(9))
#define AXI_DMA_OUTFIFO_PUSH_CH1_M  (AXI_DMA_OUTFIFO_PUSH_CH1_V << AXI_DMA_OUTFIFO_PUSH_CH1_S)
#define AXI_DMA_OUTFIFO_PUSH_CH1_V  0x00000001U
#define AXI_DMA_OUTFIFO_PUSH_CH1_S  9

/** AXI_DMA_OUT_LINK1_CH1_REG register
 *  Link descriptor configure and control register of Tx channel1
 */
#define AXI_DMA_OUT_LINK1_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1c0)
/** AXI_DMA_OUTLINK_STOP_CH1 : WT; bitpos: [0]; default: 0;
 *  Set this bit to stop dealing with the outlink descriptors.
 */
#define AXI_DMA_OUTLINK_STOP_CH1    (BIT(0))
#define AXI_DMA_OUTLINK_STOP_CH1_M  (AXI_DMA_OUTLINK_STOP_CH1_V << AXI_DMA_OUTLINK_STOP_CH1_S)
#define AXI_DMA_OUTLINK_STOP_CH1_V  0x00000001U
#define AXI_DMA_OUTLINK_STOP_CH1_S  0
/** AXI_DMA_OUTLINK_START_CH1 : WT; bitpos: [1]; default: 0;
 *  Set this bit to start dealing with the outlink descriptors.
 */
#define AXI_DMA_OUTLINK_START_CH1    (BIT(1))
#define AXI_DMA_OUTLINK_START_CH1_M  (AXI_DMA_OUTLINK_START_CH1_V << AXI_DMA_OUTLINK_START_CH1_S)
#define AXI_DMA_OUTLINK_START_CH1_V  0x00000001U
#define AXI_DMA_OUTLINK_START_CH1_S  1
/** AXI_DMA_OUTLINK_RESTART_CH1 : WT; bitpos: [2]; default: 0;
 *  Set this bit to restart a new outlink from the last address.
 */
#define AXI_DMA_OUTLINK_RESTART_CH1    (BIT(2))
#define AXI_DMA_OUTLINK_RESTART_CH1_M  (AXI_DMA_OUTLINK_RESTART_CH1_V << AXI_DMA_OUTLINK_RESTART_CH1_S)
#define AXI_DMA_OUTLINK_RESTART_CH1_V  0x00000001U
#define AXI_DMA_OUTLINK_RESTART_CH1_S  2
/** AXI_DMA_OUTLINK_PARK_CH1 : RO; bitpos: [3]; default: 1;
 *  1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM
 *  is working.
 */
#define AXI_DMA_OUTLINK_PARK_CH1    (BIT(3))
#define AXI_DMA_OUTLINK_PARK_CH1_M  (AXI_DMA_OUTLINK_PARK_CH1_V << AXI_DMA_OUTLINK_PARK_CH1_S)
#define AXI_DMA_OUTLINK_PARK_CH1_V  0x00000001U
#define AXI_DMA_OUTLINK_PARK_CH1_S  3

/** AXI_DMA_OUT_LINK2_CH1_REG register
 *  Link descriptor configure and control register of Tx channel1
 */
#define AXI_DMA_OUT_LINK2_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1c4)
/** AXI_DMA_OUTLINK_ADDR_CH1 : R/W; bitpos: [31:0]; default: 0;
 *  This register stores the 32 least significant bits of the first outlink
 *  descriptor's address.
 */
#define AXI_DMA_OUTLINK_ADDR_CH1    0xFFFFFFFFU
#define AXI_DMA_OUTLINK_ADDR_CH1_M  (AXI_DMA_OUTLINK_ADDR_CH1_V << AXI_DMA_OUTLINK_ADDR_CH1_S)
#define AXI_DMA_OUTLINK_ADDR_CH1_V  0xFFFFFFFFU
#define AXI_DMA_OUTLINK_ADDR_CH1_S  0

/** AXI_DMA_OUT_STATE_CH1_REG register
 *  Transmit status of Tx channel1
 */
#define AXI_DMA_OUT_STATE_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1c8)
/** AXI_DMA_OUTLINK_DSCR_ADDR_CH1 : RO; bitpos: [17:0]; default: 0;
 *  This register stores the current outlink descriptor's address.
 */
#define AXI_DMA_OUTLINK_DSCR_ADDR_CH1    0x0003FFFFU
#define AXI_DMA_OUTLINK_DSCR_ADDR_CH1_M  (AXI_DMA_OUTLINK_DSCR_ADDR_CH1_V << AXI_DMA_OUTLINK_DSCR_ADDR_CH1_S)
#define AXI_DMA_OUTLINK_DSCR_ADDR_CH1_V  0x0003FFFFU
#define AXI_DMA_OUTLINK_DSCR_ADDR_CH1_S  0
/** AXI_DMA_OUT_DSCR_STATE_CH1 : RO; bitpos: [19:18]; default: 0;
 *  reserved
 */
#define AXI_DMA_OUT_DSCR_STATE_CH1    0x00000003U
#define AXI_DMA_OUT_DSCR_STATE_CH1_M  (AXI_DMA_OUT_DSCR_STATE_CH1_V << AXI_DMA_OUT_DSCR_STATE_CH1_S)
#define AXI_DMA_OUT_DSCR_STATE_CH1_V  0x00000003U
#define AXI_DMA_OUT_DSCR_STATE_CH1_S  18
/** AXI_DMA_OUT_STATE_CH1 : RO; bitpos: [22:20]; default: 0;
 *  reserved
 */
#define AXI_DMA_OUT_STATE_CH1    0x00000007U
#define AXI_DMA_OUT_STATE_CH1_M  (AXI_DMA_OUT_STATE_CH1_V << AXI_DMA_OUT_STATE_CH1_S)
#define AXI_DMA_OUT_STATE_CH1_V  0x00000007U
#define AXI_DMA_OUT_STATE_CH1_S  20

/** AXI_DMA_OUT_EOF_DES_ADDR_CH1_REG register
 *  Outlink descriptor address when EOF occurs of Tx channel1
 */
#define AXI_DMA_OUT_EOF_DES_ADDR_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1cc)
/** AXI_DMA_OUT_EOF_DES_ADDR_CH1 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the outlink descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define AXI_DMA_OUT_EOF_DES_ADDR_CH1    0xFFFFFFFFU
#define AXI_DMA_OUT_EOF_DES_ADDR_CH1_M  (AXI_DMA_OUT_EOF_DES_ADDR_CH1_V << AXI_DMA_OUT_EOF_DES_ADDR_CH1_S)
#define AXI_DMA_OUT_EOF_DES_ADDR_CH1_V  0xFFFFFFFFU
#define AXI_DMA_OUT_EOF_DES_ADDR_CH1_S  0

/** AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH1_REG register
 *  The last outlink descriptor address when EOF occurs of Tx channel1
 */
#define AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1d0)
/** AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH1 : RO; bitpos: [31:0]; default: 0;
 *  This register stores the address of the outlink descriptor before the last outlink
 *  descriptor.
 */
#define AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH1    0xFFFFFFFFU
#define AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH1_M  (AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH1_V << AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH1_S)
#define AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH1_V  0xFFFFFFFFU
#define AXI_DMA_OUT_EOF_BFR_DES_ADDR_CH1_S  0

/** AXI_DMA_OUT_DSCR_CH1_REG register
 *  Current outlink descriptor address of Tx channel1
 */
#define AXI_DMA_OUT_DSCR_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1d4)
/** AXI_DMA_OUTLINK_DSCR_CH1 : RO; bitpos: [31:0]; default: 0;
 *  The address of the current outlink descriptor y.
 */
#define AXI_DMA_OUTLINK_DSCR_CH1    0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_CH1_M  (AXI_DMA_OUTLINK_DSCR_CH1_V << AXI_DMA_OUTLINK_DSCR_CH1_S)
#define AXI_DMA_OUTLINK_DSCR_CH1_V  0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_CH1_S  0

/** AXI_DMA_OUT_DSCR_BF0_CH1_REG register
 *  The last outlink descriptor address of Tx channel1
 */
#define AXI_DMA_OUT_DSCR_BF0_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1d8)
/** AXI_DMA_OUTLINK_DSCR_BF0_CH1 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last outlink descriptor y-1.
 */
#define AXI_DMA_OUTLINK_DSCR_BF0_CH1    0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_BF0_CH1_M  (AXI_DMA_OUTLINK_DSCR_BF0_CH1_V << AXI_DMA_OUTLINK_DSCR_BF0_CH1_S)
#define AXI_DMA_OUTLINK_DSCR_BF0_CH1_V  0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_BF0_CH1_S  0

/** AXI_DMA_OUT_DSCR_BF1_CH1_REG register
 *  The second-to-last outlink descriptor address of Tx channel1
 */
#define AXI_DMA_OUT_DSCR_BF1_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1dc)
/** AXI_DMA_OUTLINK_DSCR_BF1_CH1 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last outlink descriptor x-2.
 */
#define AXI_DMA_OUTLINK_DSCR_BF1_CH1    0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_BF1_CH1_M  (AXI_DMA_OUTLINK_DSCR_BF1_CH1_V << AXI_DMA_OUTLINK_DSCR_BF1_CH1_S)
#define AXI_DMA_OUTLINK_DSCR_BF1_CH1_V  0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_BF1_CH1_S  0

/** AXI_DMA_OUT_PRI_CH1_REG register
 *  Priority register of Tx channel1.
 */
#define AXI_DMA_OUT_PRI_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1e0)
/** AXI_DMA_TX_PRI_CH1 : R/W; bitpos: [3:0]; default: 0;
 *  The priority of Tx channel0. The larger of the value the higher of the priority.
 */
#define AXI_DMA_TX_PRI_CH1    0x0000000FU
#define AXI_DMA_TX_PRI_CH1_M  (AXI_DMA_TX_PRI_CH1_V << AXI_DMA_TX_PRI_CH1_S)
#define AXI_DMA_TX_PRI_CH1_V  0x0000000FU
#define AXI_DMA_TX_PRI_CH1_S  0
/** AXI_DMA_TX_CH_ARB_WEIGH_CH1 : R/W; bitpos: [7:4]; default: 0;
 *  The weight of Tx channel0
 */
#define AXI_DMA_TX_CH_ARB_WEIGH_CH1    0x0000000FU
#define AXI_DMA_TX_CH_ARB_WEIGH_CH1_M  (AXI_DMA_TX_CH_ARB_WEIGH_CH1_V << AXI_DMA_TX_CH_ARB_WEIGH_CH1_S)
#define AXI_DMA_TX_CH_ARB_WEIGH_CH1_V  0x0000000FU
#define AXI_DMA_TX_CH_ARB_WEIGH_CH1_S  4
/** AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH1 : R/W; bitpos: [8]; default: 0;
 *  0: mean not optimization weight function ,1: mean optimization
 */
#define AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH1    (BIT(8))
#define AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH1_M  (AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH1_V << AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH1_S)
#define AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH1_V  0x00000001U
#define AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH1_S  8

/** AXI_DMA_OUT_PERI_SEL_CH1_REG register
 *  Peripheral selection of Tx channel1
 */
#define AXI_DMA_OUT_PERI_SEL_CH1_REG (DR_REG_AXI_DMA_BASE + 0x1e4)
/** AXI_DMA_PERI_OUT_SEL_CH1 : R/W; bitpos: [5:0]; default: 63;
 *  This register is used to select peripheral for Tx channel0. 0:lcdcam. 1: gpspi_2.
 *  2: gpspi_3. 3: parl_io. 4: aes. 5: sha. 6~15: Dummy
 */
#define AXI_DMA_PERI_OUT_SEL_CH1    0x0000003FU
#define AXI_DMA_PERI_OUT_SEL_CH1_M  (AXI_DMA_PERI_OUT_SEL_CH1_V << AXI_DMA_PERI_OUT_SEL_CH1_S)
#define AXI_DMA_PERI_OUT_SEL_CH1_V  0x0000003FU
#define AXI_DMA_PERI_OUT_SEL_CH1_S  0

/** AXI_DMA_OUT_INT_RAW_CH2_REG register
 *  Raw status interrupt of channel2
 */
#define AXI_DMA_OUT_INT_RAW_CH2_REG (DR_REG_AXI_DMA_BASE + 0x208)
/** AXI_DMA_OUT_DONE_CH2_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one outlink
 *  descriptor has been transmitted to peripherals for Tx channel0.
 */
#define AXI_DMA_OUT_DONE_CH2_INT_RAW    (BIT(0))
#define AXI_DMA_OUT_DONE_CH2_INT_RAW_M  (AXI_DMA_OUT_DONE_CH2_INT_RAW_V << AXI_DMA_OUT_DONE_CH2_INT_RAW_S)
#define AXI_DMA_OUT_DONE_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_OUT_DONE_CH2_INT_RAW_S  0
/** AXI_DMA_OUT_EOF_CH2_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt bit turns to high level when the last data pointed by one outlink
 *  descriptor has been read from memory for Tx channel0.
 */
#define AXI_DMA_OUT_EOF_CH2_INT_RAW    (BIT(1))
#define AXI_DMA_OUT_EOF_CH2_INT_RAW_M  (AXI_DMA_OUT_EOF_CH2_INT_RAW_V << AXI_DMA_OUT_EOF_CH2_INT_RAW_S)
#define AXI_DMA_OUT_EOF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_OUT_EOF_CH2_INT_RAW_S  1
/** AXI_DMA_OUT_DSCR_ERR_CH2_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt bit turns to high level when detecting outlink descriptor error
 *  including owner error and the second and third word error of outlink descriptor for
 *  Tx channel0.
 */
#define AXI_DMA_OUT_DSCR_ERR_CH2_INT_RAW    (BIT(2))
#define AXI_DMA_OUT_DSCR_ERR_CH2_INT_RAW_M  (AXI_DMA_OUT_DSCR_ERR_CH2_INT_RAW_V << AXI_DMA_OUT_DSCR_ERR_CH2_INT_RAW_S)
#define AXI_DMA_OUT_DSCR_ERR_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_OUT_DSCR_ERR_CH2_INT_RAW_S  2
/** AXI_DMA_OUT_TOTAL_EOF_CH2_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt bit turns to high level when data corresponding a outlink
 *  (includes one link descriptor or few link descriptors) is transmitted out for Tx
 *  channel0.
 */
#define AXI_DMA_OUT_TOTAL_EOF_CH2_INT_RAW    (BIT(3))
#define AXI_DMA_OUT_TOTAL_EOF_CH2_INT_RAW_M  (AXI_DMA_OUT_TOTAL_EOF_CH2_INT_RAW_V << AXI_DMA_OUT_TOTAL_EOF_CH2_INT_RAW_S)
#define AXI_DMA_OUT_TOTAL_EOF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_OUT_TOTAL_EOF_CH2_INT_RAW_S  3
/** AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Tx channel0 is
 *  overflow.
 */
#define AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_RAW    (BIT(4))
#define AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_RAW_M  (AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_RAW_V << AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_RAW_S)
#define AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_RAW_S  4
/** AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Tx channel0 is
 *  underflow.
 */
#define AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_RAW    (BIT(5))
#define AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_RAW_M  (AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_RAW_V << AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_RAW_S)
#define AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_RAW_S  5
/** AXI_DMA_OUTFIFO_L2_OVF_CH2_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Tx channel0 is
 *  overflow.
 */
#define AXI_DMA_OUTFIFO_L2_OVF_CH2_INT_RAW    (BIT(6))
#define AXI_DMA_OUTFIFO_L2_OVF_CH2_INT_RAW_M  (AXI_DMA_OUTFIFO_L2_OVF_CH2_INT_RAW_V << AXI_DMA_OUTFIFO_L2_OVF_CH2_INT_RAW_S)
#define AXI_DMA_OUTFIFO_L2_OVF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_OVF_CH2_INT_RAW_S  6
/** AXI_DMA_OUTFIFO_L2_UDF_CH2_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Tx channel0 is
 *  underflow.
 */
#define AXI_DMA_OUTFIFO_L2_UDF_CH2_INT_RAW    (BIT(7))
#define AXI_DMA_OUTFIFO_L2_UDF_CH2_INT_RAW_M  (AXI_DMA_OUTFIFO_L2_UDF_CH2_INT_RAW_V << AXI_DMA_OUTFIFO_L2_UDF_CH2_INT_RAW_S)
#define AXI_DMA_OUTFIFO_L2_UDF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_UDF_CH2_INT_RAW_S  7
/** AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Tx channel0 is
 *  overflow.
 */
#define AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_RAW    (BIT(8))
#define AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_RAW_M  (AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_RAW_V << AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_RAW_S)
#define AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_RAW_S  8
/** AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  This raw interrupt bit turns to high level when level 1 fifo of Tx channel0 is
 *  underflow.
 */
#define AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_RAW    (BIT(9))
#define AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_RAW_M  (AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_RAW_V << AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_RAW_S)
#define AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_RAW_S  9
/** AXI_DMA_OUT_LINK_SWITCH_CH2_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  The raw interrupt bit turns to high level when the dma switch to new link for Tx
 *  channel0.
 */
#define AXI_DMA_OUT_LINK_SWITCH_CH2_INT_RAW    (BIT(10))
#define AXI_DMA_OUT_LINK_SWITCH_CH2_INT_RAW_M  (AXI_DMA_OUT_LINK_SWITCH_CH2_INT_RAW_V << AXI_DMA_OUT_LINK_SWITCH_CH2_INT_RAW_S)
#define AXI_DMA_OUT_LINK_SWITCH_CH2_INT_RAW_V  0x00000001U
#define AXI_DMA_OUT_LINK_SWITCH_CH2_INT_RAW_S  10

/** AXI_DMA_OUT_INT_ST_CH2_REG register
 *  Masked interrupt of channel2
 */
#define AXI_DMA_OUT_INT_ST_CH2_REG (DR_REG_AXI_DMA_BASE + 0x20c)
/** AXI_DMA_OUT_DONE_CH2_INT_ST : RO; bitpos: [0]; default: 0;
 *  The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.
 */
#define AXI_DMA_OUT_DONE_CH2_INT_ST    (BIT(0))
#define AXI_DMA_OUT_DONE_CH2_INT_ST_M  (AXI_DMA_OUT_DONE_CH2_INT_ST_V << AXI_DMA_OUT_DONE_CH2_INT_ST_S)
#define AXI_DMA_OUT_DONE_CH2_INT_ST_V  0x00000001U
#define AXI_DMA_OUT_DONE_CH2_INT_ST_S  0
/** AXI_DMA_OUT_EOF_CH2_INT_ST : RO; bitpos: [1]; default: 0;
 *  The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.
 */
#define AXI_DMA_OUT_EOF_CH2_INT_ST    (BIT(1))
#define AXI_DMA_OUT_EOF_CH2_INT_ST_M  (AXI_DMA_OUT_EOF_CH2_INT_ST_V << AXI_DMA_OUT_EOF_CH2_INT_ST_S)
#define AXI_DMA_OUT_EOF_CH2_INT_ST_V  0x00000001U
#define AXI_DMA_OUT_EOF_CH2_INT_ST_S  1
/** AXI_DMA_OUT_DSCR_ERR_CH2_INT_ST : RO; bitpos: [2]; default: 0;
 *  The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define AXI_DMA_OUT_DSCR_ERR_CH2_INT_ST    (BIT(2))
#define AXI_DMA_OUT_DSCR_ERR_CH2_INT_ST_M  (AXI_DMA_OUT_DSCR_ERR_CH2_INT_ST_V << AXI_DMA_OUT_DSCR_ERR_CH2_INT_ST_S)
#define AXI_DMA_OUT_DSCR_ERR_CH2_INT_ST_V  0x00000001U
#define AXI_DMA_OUT_DSCR_ERR_CH2_INT_ST_S  2
/** AXI_DMA_OUT_TOTAL_EOF_CH2_INT_ST : RO; bitpos: [3]; default: 0;
 *  The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define AXI_DMA_OUT_TOTAL_EOF_CH2_INT_ST    (BIT(3))
#define AXI_DMA_OUT_TOTAL_EOF_CH2_INT_ST_M  (AXI_DMA_OUT_TOTAL_EOF_CH2_INT_ST_V << AXI_DMA_OUT_TOTAL_EOF_CH2_INT_ST_S)
#define AXI_DMA_OUT_TOTAL_EOF_CH2_INT_ST_V  0x00000001U
#define AXI_DMA_OUT_TOTAL_EOF_CH2_INT_ST_S  3
/** AXI_DMA_OUTFIFO_OVF_CH2_INT_ST : RO; bitpos: [4]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_OVF_CH2_INT_ST    (BIT(4))
#define AXI_DMA_OUTFIFO_OVF_CH2_INT_ST_M  (AXI_DMA_OUTFIFO_OVF_CH2_INT_ST_V << AXI_DMA_OUTFIFO_OVF_CH2_INT_ST_S)
#define AXI_DMA_OUTFIFO_OVF_CH2_INT_ST_V  0x00000001U
#define AXI_DMA_OUTFIFO_OVF_CH2_INT_ST_S  4
/** AXI_DMA_OUTFIFO_UDF_CH2_INT_ST : RO; bitpos: [5]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_UDF_CH2_INT_ST    (BIT(5))
#define AXI_DMA_OUTFIFO_UDF_CH2_INT_ST_M  (AXI_DMA_OUTFIFO_UDF_CH2_INT_ST_V << AXI_DMA_OUTFIFO_UDF_CH2_INT_ST_S)
#define AXI_DMA_OUTFIFO_UDF_CH2_INT_ST_V  0x00000001U
#define AXI_DMA_OUTFIFO_UDF_CH2_INT_ST_S  5
/** AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_ST : RO; bitpos: [6]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_ST    (BIT(6))
#define AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_ST_M  (AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_ST_V << AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_ST_S)
#define AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_ST_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_ST_S  6
/** AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_ST : RO; bitpos: [7]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_ST    (BIT(7))
#define AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_ST_M  (AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_ST_V << AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_ST_S)
#define AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_ST_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_ST_S  7
/** AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_ST : RO; bitpos: [8]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_ST    (BIT(8))
#define AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_ST_M  (AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_ST_V << AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_ST_S)
#define AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_ST_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_ST_S  8
/** AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_ST : RO; bitpos: [9]; default: 0;
 *  The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_ST    (BIT(9))
#define AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_ST_M  (AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_ST_V << AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_ST_S)
#define AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_ST_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_ST_S  9
/** AXI_DMA_OUT_LINK_SWITCH_CH2_INT_ST : RO; bitpos: [10]; default: 0;
 *  The raw interrupt status bit for the OUT_LINK_SWITCH_CH_INT interrupt.
 */
#define AXI_DMA_OUT_LINK_SWITCH_CH2_INT_ST    (BIT(10))
#define AXI_DMA_OUT_LINK_SWITCH_CH2_INT_ST_M  (AXI_DMA_OUT_LINK_SWITCH_CH2_INT_ST_V << AXI_DMA_OUT_LINK_SWITCH_CH2_INT_ST_S)
#define AXI_DMA_OUT_LINK_SWITCH_CH2_INT_ST_V  0x00000001U
#define AXI_DMA_OUT_LINK_SWITCH_CH2_INT_ST_S  10

/** AXI_DMA_OUT_INT_ENA_CH2_REG register
 *  Interrupt enable bits of channel2
 */
#define AXI_DMA_OUT_INT_ENA_CH2_REG (DR_REG_AXI_DMA_BASE + 0x210)
/** AXI_DMA_OUT_DONE_CH2_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The interrupt enable bit for the OUT_DONE_CH_INT interrupt.
 */
#define AXI_DMA_OUT_DONE_CH2_INT_ENA    (BIT(0))
#define AXI_DMA_OUT_DONE_CH2_INT_ENA_M  (AXI_DMA_OUT_DONE_CH2_INT_ENA_V << AXI_DMA_OUT_DONE_CH2_INT_ENA_S)
#define AXI_DMA_OUT_DONE_CH2_INT_ENA_V  0x00000001U
#define AXI_DMA_OUT_DONE_CH2_INT_ENA_S  0
/** AXI_DMA_OUT_EOF_CH2_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The interrupt enable bit for the OUT_EOF_CH_INT interrupt.
 */
#define AXI_DMA_OUT_EOF_CH2_INT_ENA    (BIT(1))
#define AXI_DMA_OUT_EOF_CH2_INT_ENA_M  (AXI_DMA_OUT_EOF_CH2_INT_ENA_V << AXI_DMA_OUT_EOF_CH2_INT_ENA_S)
#define AXI_DMA_OUT_EOF_CH2_INT_ENA_V  0x00000001U
#define AXI_DMA_OUT_EOF_CH2_INT_ENA_S  1
/** AXI_DMA_OUT_DSCR_ERR_CH2_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define AXI_DMA_OUT_DSCR_ERR_CH2_INT_ENA    (BIT(2))
#define AXI_DMA_OUT_DSCR_ERR_CH2_INT_ENA_M  (AXI_DMA_OUT_DSCR_ERR_CH2_INT_ENA_V << AXI_DMA_OUT_DSCR_ERR_CH2_INT_ENA_S)
#define AXI_DMA_OUT_DSCR_ERR_CH2_INT_ENA_V  0x00000001U
#define AXI_DMA_OUT_DSCR_ERR_CH2_INT_ENA_S  2
/** AXI_DMA_OUT_TOTAL_EOF_CH2_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define AXI_DMA_OUT_TOTAL_EOF_CH2_INT_ENA    (BIT(3))
#define AXI_DMA_OUT_TOTAL_EOF_CH2_INT_ENA_M  (AXI_DMA_OUT_TOTAL_EOF_CH2_INT_ENA_V << AXI_DMA_OUT_TOTAL_EOF_CH2_INT_ENA_S)
#define AXI_DMA_OUT_TOTAL_EOF_CH2_INT_ENA_V  0x00000001U
#define AXI_DMA_OUT_TOTAL_EOF_CH2_INT_ENA_S  3
/** AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_ENA    (BIT(4))
#define AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_ENA_M  (AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_ENA_V << AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_ENA_S)
#define AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_ENA_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_ENA_S  4
/** AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_ENA    (BIT(5))
#define AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_ENA_M  (AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_ENA_V << AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_ENA_S)
#define AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_ENA_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_ENA_S  5
/** AXI_DMA_OUTFIFO_L2_OVF_CH2_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L2_OVF_CH2_INT_ENA    (BIT(6))
#define AXI_DMA_OUTFIFO_L2_OVF_CH2_INT_ENA_M  (AXI_DMA_OUTFIFO_L2_OVF_CH2_INT_ENA_V << AXI_DMA_OUTFIFO_L2_OVF_CH2_INT_ENA_S)
#define AXI_DMA_OUTFIFO_L2_OVF_CH2_INT_ENA_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_OVF_CH2_INT_ENA_S  6
/** AXI_DMA_OUTFIFO_L2_UDF_CH2_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L2_UDF_CH2_INT_ENA    (BIT(7))
#define AXI_DMA_OUTFIFO_L2_UDF_CH2_INT_ENA_M  (AXI_DMA_OUTFIFO_L2_UDF_CH2_INT_ENA_V << AXI_DMA_OUTFIFO_L2_UDF_CH2_INT_ENA_S)
#define AXI_DMA_OUTFIFO_L2_UDF_CH2_INT_ENA_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_UDF_CH2_INT_ENA_S  7
/** AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_OVF_L3_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_ENA    (BIT(8))
#define AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_ENA_M  (AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_ENA_V << AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_ENA_S)
#define AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_ENA_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_ENA_S  8
/** AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  The interrupt enable bit for the OUTFIFO_UDF_L3_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_ENA    (BIT(9))
#define AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_ENA_M  (AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_ENA_V << AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_ENA_S)
#define AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_ENA_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_ENA_S  9
/** AXI_DMA_OUT_LINK_SWITCH_CH2_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  The interrupt enable bit for the OUT_LINK_SWITCH_CH_INT interrupt.
 */
#define AXI_DMA_OUT_LINK_SWITCH_CH2_INT_ENA    (BIT(10))
#define AXI_DMA_OUT_LINK_SWITCH_CH2_INT_ENA_M  (AXI_DMA_OUT_LINK_SWITCH_CH2_INT_ENA_V << AXI_DMA_OUT_LINK_SWITCH_CH2_INT_ENA_S)
#define AXI_DMA_OUT_LINK_SWITCH_CH2_INT_ENA_V  0x00000001U
#define AXI_DMA_OUT_LINK_SWITCH_CH2_INT_ENA_S  10

