espressif/esp-idf/components/soc/esp32s31/register/soc/axi_dma_reg.h
/** AXI_DMA_OUT_INT_CLR_CH2_REG register
 *  Interrupt clear bits of channel2
 */
#define AXI_DMA_OUT_INT_CLR_CH2_REG (DR_REG_AXI_DMA_BASE + 0x214)
/** AXI_DMA_OUT_DONE_CH2_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear the OUT_DONE_CH_INT interrupt.
 */
#define AXI_DMA_OUT_DONE_CH2_INT_CLR    (BIT(0))
#define AXI_DMA_OUT_DONE_CH2_INT_CLR_M  (AXI_DMA_OUT_DONE_CH2_INT_CLR_V << AXI_DMA_OUT_DONE_CH2_INT_CLR_S)
#define AXI_DMA_OUT_DONE_CH2_INT_CLR_V  0x00000001U
#define AXI_DMA_OUT_DONE_CH2_INT_CLR_S  0
/** AXI_DMA_OUT_EOF_CH2_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear the OUT_EOF_CH_INT interrupt.
 */
#define AXI_DMA_OUT_EOF_CH2_INT_CLR    (BIT(1))
#define AXI_DMA_OUT_EOF_CH2_INT_CLR_M  (AXI_DMA_OUT_EOF_CH2_INT_CLR_V << AXI_DMA_OUT_EOF_CH2_INT_CLR_S)
#define AXI_DMA_OUT_EOF_CH2_INT_CLR_V  0x00000001U
#define AXI_DMA_OUT_EOF_CH2_INT_CLR_S  1
/** AXI_DMA_OUT_DSCR_ERR_CH2_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.
 */
#define AXI_DMA_OUT_DSCR_ERR_CH2_INT_CLR    (BIT(2))
#define AXI_DMA_OUT_DSCR_ERR_CH2_INT_CLR_M  (AXI_DMA_OUT_DSCR_ERR_CH2_INT_CLR_V << AXI_DMA_OUT_DSCR_ERR_CH2_INT_CLR_S)
#define AXI_DMA_OUT_DSCR_ERR_CH2_INT_CLR_V  0x00000001U
#define AXI_DMA_OUT_DSCR_ERR_CH2_INT_CLR_S  2
/** AXI_DMA_OUT_TOTAL_EOF_CH2_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.
 */
#define AXI_DMA_OUT_TOTAL_EOF_CH2_INT_CLR    (BIT(3))
#define AXI_DMA_OUT_TOTAL_EOF_CH2_INT_CLR_M  (AXI_DMA_OUT_TOTAL_EOF_CH2_INT_CLR_V << AXI_DMA_OUT_TOTAL_EOF_CH2_INT_CLR_S)
#define AXI_DMA_OUT_TOTAL_EOF_CH2_INT_CLR_V  0x00000001U
#define AXI_DMA_OUT_TOTAL_EOF_CH2_INT_CLR_S  3
/** AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_CLR    (BIT(4))
#define AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_CLR_M  (AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_CLR_V << AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_CLR_S)
#define AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_CLR_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_OVF_CH2_INT_CLR_S  4
/** AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_CLR    (BIT(5))
#define AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_CLR_M  (AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_CLR_V << AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_CLR_S)
#define AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_CLR_V  0x00000001U
#define AXI_DMA_OUTFIFO_L1_UDF_CH2_INT_CLR_S  5
/** AXI_DMA_OUTFIFO_L2_OVF_CH2_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Set this bit to clear the OUTFIFO_OVF_L2_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L2_OVF_CH2_INT_CLR    (BIT(6))
#define AXI_DMA_OUTFIFO_L2_OVF_CH2_INT_CLR_M  (AXI_DMA_OUTFIFO_L2_OVF_CH2_INT_CLR_V << AXI_DMA_OUTFIFO_L2_OVF_CH2_INT_CLR_S)
#define AXI_DMA_OUTFIFO_L2_OVF_CH2_INT_CLR_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_OVF_CH2_INT_CLR_S  6
/** AXI_DMA_OUTFIFO_L2_UDF_CH2_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Set this bit to clear the OUTFIFO_UDF_L2_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L2_UDF_CH2_INT_CLR    (BIT(7))
#define AXI_DMA_OUTFIFO_L2_UDF_CH2_INT_CLR_M  (AXI_DMA_OUTFIFO_L2_UDF_CH2_INT_CLR_V << AXI_DMA_OUTFIFO_L2_UDF_CH2_INT_CLR_S)
#define AXI_DMA_OUTFIFO_L2_UDF_CH2_INT_CLR_V  0x00000001U
#define AXI_DMA_OUTFIFO_L2_UDF_CH2_INT_CLR_S  7
/** AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_CLR : WT; bitpos: [8]; default: 0;
 *  Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_CLR    (BIT(8))
#define AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_CLR_M  (AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_CLR_V << AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_CLR_S)
#define AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_CLR_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_OVF_CH2_INT_CLR_S  8
/** AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_CLR : WT; bitpos: [9]; default: 0;
 *  Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt.
 */
#define AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_CLR    (BIT(9))
#define AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_CLR_M  (AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_CLR_V << AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_CLR_S)
#define AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_CLR_V  0x00000001U
#define AXI_DMA_OUTFIFO_L3_UDF_CH2_INT_CLR_S  9
/** AXI_DMA_OUT_LINK_SWITCH_CH2_INT_CLR : WT; bitpos: [10]; default: 0;
 *  Set this bit to clear the OUT_LINK_SWITCH_CH_INT interrupt.
 */
#define AXI_DMA_OUT_LINK_SWITCH_CH2_INT_CLR    (BIT(10))
#define AXI_DMA_OUT_LINK_SWITCH_CH2_INT_CLR_M  (AXI_DMA_OUT_LINK_SWITCH_CH2_INT_CLR_V << AXI_DMA_OUT_LINK_SWITCH_CH2_INT_CLR_S)
#define AXI_DMA_OUT_LINK_SWITCH_CH2_INT_CLR_V  0x00000001U
#define AXI_DMA_OUT_LINK_SWITCH_CH2_INT_CLR_S  10

/** AXI_DMA_OUT_CONF0_CH2_REG register
 *  Configure 0 register of Tx channel2
 */
#define AXI_DMA_OUT_CONF0_CH2_REG (DR_REG_AXI_DMA_BASE + 0x218)
/** AXI_DMA_OUT_RST_CH2 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to reset AXI_DMA channel2 Tx FSM and Tx FIFO pointer.
 */
#define AXI_DMA_OUT_RST_CH2    (BIT(0))
#define AXI_DMA_OUT_RST_CH2_M  (AXI_DMA_OUT_RST_CH2_V << AXI_DMA_OUT_RST_CH2_S)
#define AXI_DMA_OUT_RST_CH2_V  0x00000001U
#define AXI_DMA_OUT_RST_CH2_S  0
/** AXI_DMA_OUT_LOOP_TEST_CH2 : R/W; bitpos: [1]; default: 0;
 *  reserved
 */
#define AXI_DMA_OUT_LOOP_TEST_CH2    (BIT(1))
#define AXI_DMA_OUT_LOOP_TEST_CH2_M  (AXI_DMA_OUT_LOOP_TEST_CH2_V << AXI_DMA_OUT_LOOP_TEST_CH2_S)
#define AXI_DMA_OUT_LOOP_TEST_CH2_V  0x00000001U
#define AXI_DMA_OUT_LOOP_TEST_CH2_S  1
/** AXI_DMA_OUT_AUTO_WRBACK_CH2 : R/W; bitpos: [2]; default: 0;
 *  Set this bit to enable automatic outlink-writeback when all the data in tx buffer
 *  has been transmitted.
 */
#define AXI_DMA_OUT_AUTO_WRBACK_CH2    (BIT(2))
#define AXI_DMA_OUT_AUTO_WRBACK_CH2_M  (AXI_DMA_OUT_AUTO_WRBACK_CH2_V << AXI_DMA_OUT_AUTO_WRBACK_CH2_S)
#define AXI_DMA_OUT_AUTO_WRBACK_CH2_V  0x00000001U
#define AXI_DMA_OUT_AUTO_WRBACK_CH2_S  2
/** AXI_DMA_OUT_EOF_MODE_CH2 : R/W; bitpos: [3]; default: 1;
 *  EOF flag generation mode when transmitting data. 1: EOF flag for Tx channel2 is
 *  generated when data need to transmit has been popped from FIFO in AXI_DMA
 */
#define AXI_DMA_OUT_EOF_MODE_CH2    (BIT(3))
#define AXI_DMA_OUT_EOF_MODE_CH2_M  (AXI_DMA_OUT_EOF_MODE_CH2_V << AXI_DMA_OUT_EOF_MODE_CH2_S)
#define AXI_DMA_OUT_EOF_MODE_CH2_V  0x00000001U
#define AXI_DMA_OUT_EOF_MODE_CH2_S  3
/** AXI_DMA_OUT_ETM_EN_CH2 : R/W; bitpos: [4]; default: 0;
 *  Set this bit to 1 to enable etm control mode, dma Tx channel2 is triggered by etm
 *  task.
 */
#define AXI_DMA_OUT_ETM_EN_CH2    (BIT(4))
#define AXI_DMA_OUT_ETM_EN_CH2_M  (AXI_DMA_OUT_ETM_EN_CH2_V << AXI_DMA_OUT_ETM_EN_CH2_S)
#define AXI_DMA_OUT_ETM_EN_CH2_V  0x00000001U
#define AXI_DMA_OUT_ETM_EN_CH2_S  4
/** AXI_DMA_OUT_BURST_SIZE_SEL_CH2 : R/W; bitpos: [7:5]; default: 0;
 *  3'b000-3'b100:burst length 8byte~128byte
 */
#define AXI_DMA_OUT_BURST_SIZE_SEL_CH2    0x00000007U
#define AXI_DMA_OUT_BURST_SIZE_SEL_CH2_M  (AXI_DMA_OUT_BURST_SIZE_SEL_CH2_V << AXI_DMA_OUT_BURST_SIZE_SEL_CH2_S)
#define AXI_DMA_OUT_BURST_SIZE_SEL_CH2_V  0x00000007U
#define AXI_DMA_OUT_BURST_SIZE_SEL_CH2_S  5
/** AXI_DMA_OUT_CMD_DISABLE_CH2 : R/W; bitpos: [8]; default: 0;
 *  1:mean disable cmd of this ch2
 */
#define AXI_DMA_OUT_CMD_DISABLE_CH2    (BIT(8))
#define AXI_DMA_OUT_CMD_DISABLE_CH2_M  (AXI_DMA_OUT_CMD_DISABLE_CH2_V << AXI_DMA_OUT_CMD_DISABLE_CH2_S)
#define AXI_DMA_OUT_CMD_DISABLE_CH2_V  0x00000001U
#define AXI_DMA_OUT_CMD_DISABLE_CH2_S  8
/** AXI_DMA_OUT_ECC_AEC_EN_CH2 : R/W; bitpos: [9]; default: 0;
 *  1: mean access ecc or aes domain,0: mean not
 */
#define AXI_DMA_OUT_ECC_AEC_EN_CH2    (BIT(9))
#define AXI_DMA_OUT_ECC_AEC_EN_CH2_M  (AXI_DMA_OUT_ECC_AEC_EN_CH2_V << AXI_DMA_OUT_ECC_AEC_EN_CH2_S)
#define AXI_DMA_OUT_ECC_AEC_EN_CH2_V  0x00000001U
#define AXI_DMA_OUT_ECC_AEC_EN_CH2_S  9
/** AXI_DMA_OUTDSCR_BURST_EN_CH2 : R/W; bitpos: [10]; default: 0;
 *  Set this bit to 1 to enable INCR burst transfer for Tx channel2 reading link
 *  descriptor when accessing internal SRAM.
 */
#define AXI_DMA_OUTDSCR_BURST_EN_CH2    (BIT(10))
#define AXI_DMA_OUTDSCR_BURST_EN_CH2_M  (AXI_DMA_OUTDSCR_BURST_EN_CH2_V << AXI_DMA_OUTDSCR_BURST_EN_CH2_S)
#define AXI_DMA_OUTDSCR_BURST_EN_CH2_V  0x00000001U
#define AXI_DMA_OUTDSCR_BURST_EN_CH2_S  10

/** AXI_DMA_OUT_CONF1_CH2_REG register
 *  Configure 1 register of Tx channel2
 */
#define AXI_DMA_OUT_CONF1_CH2_REG (DR_REG_AXI_DMA_BASE + 0x21c)
/** AXI_DMA_OUT_CHECK_OWNER_CH2 : R/W; bitpos: [12]; default: 0;
 *  Set this bit to enable checking the owner attribute of the link descriptor.
 */
#define AXI_DMA_OUT_CHECK_OWNER_CH2    (BIT(12))
#define AXI_DMA_OUT_CHECK_OWNER_CH2_M  (AXI_DMA_OUT_CHECK_OWNER_CH2_V << AXI_DMA_OUT_CHECK_OWNER_CH2_S)
#define AXI_DMA_OUT_CHECK_OWNER_CH2_V  0x00000001U
#define AXI_DMA_OUT_CHECK_OWNER_CH2_S  12

