espressif/esp-idf/components/soc/esp32s31/register/soc/axi_dma_reg.h
/** AXI_DMA_OUT_DSCR_CH2_REG register
 *  Current outlink descriptor address of Tx channel2
 */
#define AXI_DMA_OUT_DSCR_CH2_REG (DR_REG_AXI_DMA_BASE + 0x23c)
/** AXI_DMA_OUTLINK_DSCR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  The address of the current outlink descriptor y.
 */
#define AXI_DMA_OUTLINK_DSCR_CH2    0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_CH2_M  (AXI_DMA_OUTLINK_DSCR_CH2_V << AXI_DMA_OUTLINK_DSCR_CH2_S)
#define AXI_DMA_OUTLINK_DSCR_CH2_V  0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_CH2_S  0

/** AXI_DMA_OUT_DSCR_BF0_CH2_REG register
 *  The last outlink descriptor address of Tx channel2
 */
#define AXI_DMA_OUT_DSCR_BF0_CH2_REG (DR_REG_AXI_DMA_BASE + 0x240)
/** AXI_DMA_OUTLINK_DSCR_BF0_CH2 : RO; bitpos: [31:0]; default: 0;
 *  The address of the last outlink descriptor y-1.
 */
#define AXI_DMA_OUTLINK_DSCR_BF0_CH2    0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_BF0_CH2_M  (AXI_DMA_OUTLINK_DSCR_BF0_CH2_V << AXI_DMA_OUTLINK_DSCR_BF0_CH2_S)
#define AXI_DMA_OUTLINK_DSCR_BF0_CH2_V  0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_BF0_CH2_S  0

/** AXI_DMA_OUT_DSCR_BF1_CH2_REG register
 *  The second-to-last outlink descriptor address of Tx channel2
 */
#define AXI_DMA_OUT_DSCR_BF1_CH2_REG (DR_REG_AXI_DMA_BASE + 0x244)
/** AXI_DMA_OUTLINK_DSCR_BF1_CH2 : RO; bitpos: [31:0]; default: 0;
 *  The address of the second-to-last outlink descriptor x-2.
 */
#define AXI_DMA_OUTLINK_DSCR_BF1_CH2    0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_BF1_CH2_M  (AXI_DMA_OUTLINK_DSCR_BF1_CH2_V << AXI_DMA_OUTLINK_DSCR_BF1_CH2_S)
#define AXI_DMA_OUTLINK_DSCR_BF1_CH2_V  0xFFFFFFFFU
#define AXI_DMA_OUTLINK_DSCR_BF1_CH2_S  0

/** AXI_DMA_OUT_PRI_CH2_REG register
 *  Priority register of Tx channel2.
 */
#define AXI_DMA_OUT_PRI_CH2_REG (DR_REG_AXI_DMA_BASE + 0x248)
/** AXI_DMA_TX_PRI_CH2 : R/W; bitpos: [3:0]; default: 0;
 *  The priority of Tx channel0. The larger of the value the higher of the priority.
 */
#define AXI_DMA_TX_PRI_CH2    0x0000000FU
#define AXI_DMA_TX_PRI_CH2_M  (AXI_DMA_TX_PRI_CH2_V << AXI_DMA_TX_PRI_CH2_S)
#define AXI_DMA_TX_PRI_CH2_V  0x0000000FU
#define AXI_DMA_TX_PRI_CH2_S  0
/** AXI_DMA_TX_CH_ARB_WEIGH_CH2 : R/W; bitpos: [7:4]; default: 0;
 *  The weight of Tx channel0
 */
#define AXI_DMA_TX_CH_ARB_WEIGH_CH2    0x0000000FU
#define AXI_DMA_TX_CH_ARB_WEIGH_CH2_M  (AXI_DMA_TX_CH_ARB_WEIGH_CH2_V << AXI_DMA_TX_CH_ARB_WEIGH_CH2_S)
#define AXI_DMA_TX_CH_ARB_WEIGH_CH2_V  0x0000000FU
#define AXI_DMA_TX_CH_ARB_WEIGH_CH2_S  4
/** AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH2 : R/W; bitpos: [8]; default: 0;
 *  0: mean not optimization weight function ,1: mean optimization
 */
#define AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH2    (BIT(8))
#define AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH2_M  (AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH2_V << AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH2_S)
#define AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH2_V  0x00000001U
#define AXI_DMA_TX_ARB_WEIGH_OPT_DIR_CH2_S  8

/** AXI_DMA_OUT_PERI_SEL_CH2_REG register
 *  Peripheral selection of Tx channel2
 */
#define AXI_DMA_OUT_PERI_SEL_CH2_REG (DR_REG_AXI_DMA_BASE + 0x24c)
/** AXI_DMA_PERI_OUT_SEL_CH2 : R/W; bitpos: [5:0]; default: 63;
 *  This register is used to select peripheral for Tx channel0. 0:lcdcam. 1: gpspi_2.
 *  2: gpspi_3. 3: parl_io. 4: aes. 5: sha. 6~15: Dummy
 */
#define AXI_DMA_PERI_OUT_SEL_CH2    0x0000003FU
#define AXI_DMA_PERI_OUT_SEL_CH2_M  (AXI_DMA_PERI_OUT_SEL_CH2_V << AXI_DMA_PERI_OUT_SEL_CH2_S)
#define AXI_DMA_PERI_OUT_SEL_CH2_V  0x0000003FU
#define AXI_DMA_PERI_OUT_SEL_CH2_S  0

/** AXI_DMA_ARB_TIMEOUT_REG register
 *  This retister is used to config arbiter time slice
 */
#define AXI_DMA_ARB_TIMEOUT_REG (DR_REG_AXI_DMA_BASE + 0x270)
/** AXI_DMA_ARB_TIMEOUT_TX : R/W; bitpos: [15:0]; default: 0;
 *  This register is used to config tx arbiter time out value
 */
#define AXI_DMA_ARB_TIMEOUT_TX    0x0000FFFFU
#define AXI_DMA_ARB_TIMEOUT_TX_M  (AXI_DMA_ARB_TIMEOUT_TX_V << AXI_DMA_ARB_TIMEOUT_TX_S)
#define AXI_DMA_ARB_TIMEOUT_TX_V  0x0000FFFFU
#define AXI_DMA_ARB_TIMEOUT_TX_S  0
/** AXI_DMA_ARB_TIMEOUT_RX : R/W; bitpos: [31:16]; default: 0;
 *  This register is used to config rx arbiter time out value
 */
#define AXI_DMA_ARB_TIMEOUT_RX    0x0000FFFFU
#define AXI_DMA_ARB_TIMEOUT_RX_M  (AXI_DMA_ARB_TIMEOUT_RX_V << AXI_DMA_ARB_TIMEOUT_RX_S)
#define AXI_DMA_ARB_TIMEOUT_RX_V  0x0000FFFFU
#define AXI_DMA_ARB_TIMEOUT_RX_S  16

/** AXI_DMA_WEIGHT_EN_REG register
 *  This register is used to config arbiter weight function to on or off
 */
#define AXI_DMA_WEIGHT_EN_REG (DR_REG_AXI_DMA_BASE + 0x274)
/** AXI_DMA_WEIGHT_EN_TX : R/W; bitpos: [0]; default: 0;
 *  This register is used to config tx arbiter weight function  off/on
 */
#define AXI_DMA_WEIGHT_EN_TX    (BIT(0))
#define AXI_DMA_WEIGHT_EN_TX_M  (AXI_DMA_WEIGHT_EN_TX_V << AXI_DMA_WEIGHT_EN_TX_S)
#define AXI_DMA_WEIGHT_EN_TX_V  0x00000001U
#define AXI_DMA_WEIGHT_EN_TX_S  0
/** AXI_DMA_WEIGHT_EN_RX : R/W; bitpos: [1]; default: 0;
 *  This register is used to config rx arbiter weight function  off/on
 */
#define AXI_DMA_WEIGHT_EN_RX    (BIT(1))
#define AXI_DMA_WEIGHT_EN_RX_M  (AXI_DMA_WEIGHT_EN_RX_V << AXI_DMA_WEIGHT_EN_RX_S)
#define AXI_DMA_WEIGHT_EN_RX_V  0x00000001U
#define AXI_DMA_WEIGHT_EN_RX_S  1

/** AXI_DMA_IN_MEM_CONF_REG register
 *  Mem power configure register of Rx channel
 */
#define AXI_DMA_IN_MEM_CONF_REG (DR_REG_AXI_DMA_BASE + 0x278)
/** AXI_DMA_IN_MEM_CLK_FORCE_EN : R/W; bitpos: [0]; default: 0;
 *  1: Force to open the clock and bypass the gate-clock when accessing the RAM in
 *  AXI_DMA. 0: A gate-clock will be used when accessing the RAM in AXI_DMA.
 */
#define AXI_DMA_IN_MEM_CLK_FORCE_EN    (BIT(0))
#define AXI_DMA_IN_MEM_CLK_FORCE_EN_M  (AXI_DMA_IN_MEM_CLK_FORCE_EN_V << AXI_DMA_IN_MEM_CLK_FORCE_EN_S)
#define AXI_DMA_IN_MEM_CLK_FORCE_EN_V  0x00000001U
#define AXI_DMA_IN_MEM_CLK_FORCE_EN_S  0
/** AXI_DMA_IN_MEM_FORCE_PU : R/W; bitpos: [1]; default: 0;
 *  Force power up ram
 */
#define AXI_DMA_IN_MEM_FORCE_PU    (BIT(1))
#define AXI_DMA_IN_MEM_FORCE_PU_M  (AXI_DMA_IN_MEM_FORCE_PU_V << AXI_DMA_IN_MEM_FORCE_PU_S)
#define AXI_DMA_IN_MEM_FORCE_PU_V  0x00000001U
#define AXI_DMA_IN_MEM_FORCE_PU_S  1
/** AXI_DMA_IN_MEM_FORCE_PD : R/W; bitpos: [2]; default: 0;
 *  Force power down ram
 */
#define AXI_DMA_IN_MEM_FORCE_PD    (BIT(2))
#define AXI_DMA_IN_MEM_FORCE_PD_M  (AXI_DMA_IN_MEM_FORCE_PD_V << AXI_DMA_IN_MEM_FORCE_PD_S)
#define AXI_DMA_IN_MEM_FORCE_PD_V  0x00000001U
#define AXI_DMA_IN_MEM_FORCE_PD_S  2
/** AXI_DMA_OUT_MEM_CLK_FORCE_EN : R/W; bitpos: [3]; default: 0;
 *  1: Force to open the clock and bypass the gate-clock when accessing the RAM in
 *  AXI_DMA. 0: A gate-clock will be used when accessing the RAM in AXI_DMA.
 */
#define AXI_DMA_OUT_MEM_CLK_FORCE_EN    (BIT(3))
#define AXI_DMA_OUT_MEM_CLK_FORCE_EN_M  (AXI_DMA_OUT_MEM_CLK_FORCE_EN_V << AXI_DMA_OUT_MEM_CLK_FORCE_EN_S)
#define AXI_DMA_OUT_MEM_CLK_FORCE_EN_V  0x00000001U
#define AXI_DMA_OUT_MEM_CLK_FORCE_EN_S  3
/** AXI_DMA_OUT_MEM_FORCE_PU : R/W; bitpos: [4]; default: 0;
 *  Force power up ram
 */
#define AXI_DMA_OUT_MEM_FORCE_PU    (BIT(4))
#define AXI_DMA_OUT_MEM_FORCE_PU_M  (AXI_DMA_OUT_MEM_FORCE_PU_V << AXI_DMA_OUT_MEM_FORCE_PU_S)
#define AXI_DMA_OUT_MEM_FORCE_PU_V  0x00000001U
#define AXI_DMA_OUT_MEM_FORCE_PU_S  4
/** AXI_DMA_OUT_MEM_FORCE_PD : R/W; bitpos: [5]; default: 0;
 *  Force power down ram
 */
#define AXI_DMA_OUT_MEM_FORCE_PD    (BIT(5))
#define AXI_DMA_OUT_MEM_FORCE_PD_M  (AXI_DMA_OUT_MEM_FORCE_PD_V << AXI_DMA_OUT_MEM_FORCE_PD_S)
#define AXI_DMA_OUT_MEM_FORCE_PD_V  0x00000001U
#define AXI_DMA_OUT_MEM_FORCE_PD_S  5

