espressif/esp-idf/components/soc/esp32s31/register/soc/axi_dma_reg.h
/** AXI_DMA_WRESP_CNT_REG register
 *  AXI wr response cnt register.
 */
#define AXI_DMA_WRESP_CNT_REG (DR_REG_AXI_DMA_BASE + 0x2b8)
/** AXI_DMA_WRESP_CNT : RO; bitpos: [3:0]; default: 0;
 *  axi wr response cnt reg.
 */
#define AXI_DMA_WRESP_CNT    0x0000000FU
#define AXI_DMA_WRESP_CNT_M  (AXI_DMA_WRESP_CNT_V << AXI_DMA_WRESP_CNT_S)
#define AXI_DMA_WRESP_CNT_V  0x0000000FU
#define AXI_DMA_WRESP_CNT_S  0

/** AXI_DMA_RRESP_CNT_REG register
 *  AXI wr response cnt register.
 */
#define AXI_DMA_RRESP_CNT_REG (DR_REG_AXI_DMA_BASE + 0x2bc)
/** AXI_DMA_RRESP_CNT : RO; bitpos: [3:0]; default: 0;
 *  axi rd response cnt reg.
 */
#define AXI_DMA_RRESP_CNT    0x0000000FU
#define AXI_DMA_RRESP_CNT_M  (AXI_DMA_RRESP_CNT_V << AXI_DMA_RRESP_CNT_S)
#define AXI_DMA_RRESP_CNT_V  0x0000000FU
#define AXI_DMA_RRESP_CNT_S  0

/** AXI_DMA_INFIFO_STATUS1_CH0_REG register
 *  Receive FIFO status of Rx channel 0
 */
#define AXI_DMA_INFIFO_STATUS1_CH0_REG (DR_REG_AXI_DMA_BASE + 0x2c0)
/** AXI_DMA_L1INFIFO_CNT_CH0 : RO; bitpos: [5:0]; default: 0;
 *  The register stores the byte number of the data in L1 Rx FIFO for Rx channel 0.
 */
#define AXI_DMA_L1INFIFO_CNT_CH0    0x0000003FU
#define AXI_DMA_L1INFIFO_CNT_CH0_M  (AXI_DMA_L1INFIFO_CNT_CH0_V << AXI_DMA_L1INFIFO_CNT_CH0_S)
#define AXI_DMA_L1INFIFO_CNT_CH0_V  0x0000003FU
#define AXI_DMA_L1INFIFO_CNT_CH0_S  0
/** AXI_DMA_L2INFIFO_CNT_CH0 : RO; bitpos: [9:6]; default: 0;
 *  The register stores the byte number of the data in L2 Rx FIFO for Rx channel 0.
 */
#define AXI_DMA_L2INFIFO_CNT_CH0    0x0000000FU
#define AXI_DMA_L2INFIFO_CNT_CH0_M  (AXI_DMA_L2INFIFO_CNT_CH0_V << AXI_DMA_L2INFIFO_CNT_CH0_S)
#define AXI_DMA_L2INFIFO_CNT_CH0_V  0x0000000FU
#define AXI_DMA_L2INFIFO_CNT_CH0_S  6

/** AXI_DMA_INFIFO_STATUS1_CH1_REG register
 *  Receive FIFO status of Rx channel 1
 */
#define AXI_DMA_INFIFO_STATUS1_CH1_REG (DR_REG_AXI_DMA_BASE + 0x2c4)
/** AXI_DMA_L1INFIFO_CNT_CH1 : RO; bitpos: [5:0]; default: 0;
 *  The register stores the byte number of the data in L1 Rx FIFO for Rx channel 0.
 */
#define AXI_DMA_L1INFIFO_CNT_CH1    0x0000003FU
#define AXI_DMA_L1INFIFO_CNT_CH1_M  (AXI_DMA_L1INFIFO_CNT_CH1_V << AXI_DMA_L1INFIFO_CNT_CH1_S)
#define AXI_DMA_L1INFIFO_CNT_CH1_V  0x0000003FU
#define AXI_DMA_L1INFIFO_CNT_CH1_S  0
/** AXI_DMA_L2INFIFO_CNT_CH1 : RO; bitpos: [9:6]; default: 0;
 *  The register stores the byte number of the data in L2 Rx FIFO for Rx channel 0.
 */
#define AXI_DMA_L2INFIFO_CNT_CH1    0x0000000FU
#define AXI_DMA_L2INFIFO_CNT_CH1_M  (AXI_DMA_L2INFIFO_CNT_CH1_V << AXI_DMA_L2INFIFO_CNT_CH1_S)
#define AXI_DMA_L2INFIFO_CNT_CH1_V  0x0000000FU
#define AXI_DMA_L2INFIFO_CNT_CH1_S  6

/** AXI_DMA_INFIFO_STATUS1_CH2_REG register
 *  Receive FIFO status of Rx channel 2
 */
#define AXI_DMA_INFIFO_STATUS1_CH2_REG (DR_REG_AXI_DMA_BASE + 0x2c8)
/** AXI_DMA_L1INFIFO_CNT_CH2 : RO; bitpos: [5:0]; default: 0;
 *  The register stores the byte number of the data in L1 Rx FIFO for Rx channel 0.
 */
#define AXI_DMA_L1INFIFO_CNT_CH2    0x0000003FU
#define AXI_DMA_L1INFIFO_CNT_CH2_M  (AXI_DMA_L1INFIFO_CNT_CH2_V << AXI_DMA_L1INFIFO_CNT_CH2_S)
#define AXI_DMA_L1INFIFO_CNT_CH2_V  0x0000003FU
#define AXI_DMA_L1INFIFO_CNT_CH2_S  0
/** AXI_DMA_L2INFIFO_CNT_CH2 : RO; bitpos: [9:6]; default: 0;
 *  The register stores the byte number of the data in L2 Rx FIFO for Rx channel 0.
 */
#define AXI_DMA_L2INFIFO_CNT_CH2    0x0000000FU
#define AXI_DMA_L2INFIFO_CNT_CH2_M  (AXI_DMA_L2INFIFO_CNT_CH2_V << AXI_DMA_L2INFIFO_CNT_CH2_S)
#define AXI_DMA_L2INFIFO_CNT_CH2_V  0x0000000FU
#define AXI_DMA_L2INFIFO_CNT_CH2_S  6

/** AXI_DMA_OUTFIFO_STATUS1_CH0_REG register
 *  Receive FIFO status of Tx channel 0
 */
#define AXI_DMA_OUTFIFO_STATUS1_CH0_REG (DR_REG_AXI_DMA_BASE + 0x2cc)
/** AXI_DMA_L1OUTFIFO_CNT_CH0 : RO; bitpos: [5:0]; default: 0;
 *  The register stores the byte number of the data in L1 Tx FIFO for Tx channel 0.
 */
#define AXI_DMA_L1OUTFIFO_CNT_CH0    0x0000003FU
#define AXI_DMA_L1OUTFIFO_CNT_CH0_M  (AXI_DMA_L1OUTFIFO_CNT_CH0_V << AXI_DMA_L1OUTFIFO_CNT_CH0_S)
#define AXI_DMA_L1OUTFIFO_CNT_CH0_V  0x0000003FU
#define AXI_DMA_L1OUTFIFO_CNT_CH0_S  0
/** AXI_DMA_L2OUTFIFO_CNT_CH0 : RO; bitpos: [9:6]; default: 0;
 *  The register stores the byte number of the data in L2 Tx FIFO for Tx channel 0.
 */
#define AXI_DMA_L2OUTFIFO_CNT_CH0    0x0000000FU
#define AXI_DMA_L2OUTFIFO_CNT_CH0_M  (AXI_DMA_L2OUTFIFO_CNT_CH0_V << AXI_DMA_L2OUTFIFO_CNT_CH0_S)
#define AXI_DMA_L2OUTFIFO_CNT_CH0_V  0x0000000FU
#define AXI_DMA_L2OUTFIFO_CNT_CH0_S  6

/** AXI_DMA_OUTFIFO_STATUS1_CH1_REG register
 *  Receive FIFO status of Tx channel 1
 */
#define AXI_DMA_OUTFIFO_STATUS1_CH1_REG (DR_REG_AXI_DMA_BASE + 0x2d0)
/** AXI_DMA_L1OUTFIFO_CNT_CH1 : RO; bitpos: [5:0]; default: 0;
 *  The register stores the byte number of the data in L1 Tx FIFO for Tx channel 0.
 */
#define AXI_DMA_L1OUTFIFO_CNT_CH1    0x0000003FU
#define AXI_DMA_L1OUTFIFO_CNT_CH1_M  (AXI_DMA_L1OUTFIFO_CNT_CH1_V << AXI_DMA_L1OUTFIFO_CNT_CH1_S)
#define AXI_DMA_L1OUTFIFO_CNT_CH1_V  0x0000003FU
#define AXI_DMA_L1OUTFIFO_CNT_CH1_S  0
/** AXI_DMA_L2OUTFIFO_CNT_CH1 : RO; bitpos: [9:6]; default: 0;
 *  The register stores the byte number of the data in L2 Tx FIFO for Tx channel 0.
 */
#define AXI_DMA_L2OUTFIFO_CNT_CH1    0x0000000FU
#define AXI_DMA_L2OUTFIFO_CNT_CH1_M  (AXI_DMA_L2OUTFIFO_CNT_CH1_V << AXI_DMA_L2OUTFIFO_CNT_CH1_S)
#define AXI_DMA_L2OUTFIFO_CNT_CH1_V  0x0000000FU
#define AXI_DMA_L2OUTFIFO_CNT_CH1_S  6

/** AXI_DMA_OUTFIFO_STATUS1_CH2_REG register
 *  Receive FIFO status of Tx channel 2
 */
#define AXI_DMA_OUTFIFO_STATUS1_CH2_REG (DR_REG_AXI_DMA_BASE + 0x2d4)
/** AXI_DMA_L1OUTFIFO_CNT_CH2 : RO; bitpos: [5:0]; default: 0;
 *  The register stores the byte number of the data in L1 Tx FIFO for Tx channel 0.
 */
#define AXI_DMA_L1OUTFIFO_CNT_CH2    0x0000003FU
#define AXI_DMA_L1OUTFIFO_CNT_CH2_M  (AXI_DMA_L1OUTFIFO_CNT_CH2_V << AXI_DMA_L1OUTFIFO_CNT_CH2_S)
#define AXI_DMA_L1OUTFIFO_CNT_CH2_V  0x0000003FU
#define AXI_DMA_L1OUTFIFO_CNT_CH2_S  0
/** AXI_DMA_L2OUTFIFO_CNT_CH2 : RO; bitpos: [9:6]; default: 0;
 *  The register stores the byte number of the data in L2 Tx FIFO for Tx channel 0.
 */
#define AXI_DMA_L2OUTFIFO_CNT_CH2    0x0000000FU
#define AXI_DMA_L2OUTFIFO_CNT_CH2_M  (AXI_DMA_L2OUTFIFO_CNT_CH2_V << AXI_DMA_L2OUTFIFO_CNT_CH2_S)
#define AXI_DMA_L2OUTFIFO_CNT_CH2_V  0x0000000FU
#define AXI_DMA_L2OUTFIFO_CNT_CH2_S  6

/** AXI_DMA_DATE_REG register
 *  Version control register
 */
#define AXI_DMA_DATE_REG (DR_REG_AXI_DMA_BASE + 0x2d8)
/** AXI_DMA_DATE : R/W; bitpos: [31:0]; default: 36712768;
 *  register version.
 */
#define AXI_DMA_DATE    0xFFFFFFFFU
#define AXI_DMA_DATE_M  (AXI_DMA_DATE_V << AXI_DMA_DATE_S)
#define AXI_DMA_DATE_V  0xFFFFFFFFU
#define AXI_DMA_DATE_S  0

/** AXI_DMA_LINK_SWITCH_STATE_REG register
 *  Version control register
 */
#define AXI_DMA_LINK_SWITCH_STATE_REG (DR_REG_AXI_DMA_BASE + 0x2dc)
/** AXI_DMA_LINK_SWITCH_STATE_CH0 : R/W; bitpos: [0]; default: 0;
 *  The register that confirm ch dscr switch success
 */
#define AXI_DMA_LINK_SWITCH_STATE_CH0    (BIT(0))
#define AXI_DMA_LINK_SWITCH_STATE_CH0_M  (AXI_DMA_LINK_SWITCH_STATE_CH0_V << AXI_DMA_LINK_SWITCH_STATE_CH0_S)
#define AXI_DMA_LINK_SWITCH_STATE_CH0_V  0x00000001U
#define AXI_DMA_LINK_SWITCH_STATE_CH0_S  0
/** AXI_DMA_LINK_SWITCH_STATE_CH1 : R/W; bitpos: [1]; default: 0;
 *  The register that confirm ch dscr switch success
 */
#define AXI_DMA_LINK_SWITCH_STATE_CH1    (BIT(1))
#define AXI_DMA_LINK_SWITCH_STATE_CH1_M  (AXI_DMA_LINK_SWITCH_STATE_CH1_V << AXI_DMA_LINK_SWITCH_STATE_CH1_S)
#define AXI_DMA_LINK_SWITCH_STATE_CH1_V  0x00000001U
#define AXI_DMA_LINK_SWITCH_STATE_CH1_S  1
/** AXI_DMA_LINK_SWITCH_STATE_CH2 : R/W; bitpos: [2]; default: 0;
 *  The register that confirm ch dscr switch success
 */
#define AXI_DMA_LINK_SWITCH_STATE_CH2    (BIT(2))
#define AXI_DMA_LINK_SWITCH_STATE_CH2_M  (AXI_DMA_LINK_SWITCH_STATE_CH2_V << AXI_DMA_LINK_SWITCH_STATE_CH2_S)
#define AXI_DMA_LINK_SWITCH_STATE_CH2_V  0x00000001U
#define AXI_DMA_LINK_SWITCH_STATE_CH2_S  2

#ifdef __cplusplus
}
#endif
